const data = {
    nm_fs: {
        r: '1000000000 / 1000000000000000',
        query: ['nm/fs', 'нм/фс', 'нанометроввфемтосекунду', 'нмвфсек', 'нмвфс']
    },
    mcm_fs: {
        r: '1000000 / 1000000000000000',
        query: ['mcm/fs', 'мкм/фс', 'микронвфемтосекунду', 'микрометроввфемтосекунду', 'мкмвфсек', 'мкмвфс']
    },
    mm_fs: {
        r: '1000 / 1000000000000000',
        query: ['mm/fs', 'мм/фс', 'миллиметроввфемтосекунду', 'ммвфсек', 'ммвфс']
    },
    cm_fs: {
        r: '100 / 1000000000000000',
        query: ['cm/fs', 'см/фс', 'сантиметроввфемтосекунду', 'смвфсек', 'смвфс']
    },
    dm_fs: {
        r: '10 / 1000000000000000',
        query: ['dm/fs', 'дм/фс', 'дециметроввфемтосекунду', 'дмвфсек', 'дмвфс']
    },
    m_fs: {
        r: '1 / 1000000000000000',
        query: ['m/fs', 'м/фс', 'метроввфемтосекунду', 'мвфсек', 'мвфс']
    },
    km_fs: {
        r: '(1 / 1000) / 1000000000000000',
        query: ['km/fs', 'км/фс', 'километроввфемтосекунду', 'кмвфсек', 'кмвфс']
    },
    mi_fs: {
        r: '(1 / 1609) / 1000000000000000',
        query: ['mpfs', 'miles/fs', 'миль/фс', 'мильвфемтосекунду', 'мильвфсек', 'мильвфс']
    },
    yd_fs: {
        r: '1.094 / 1000000000000000',
        query: ['ypfs', 'yards/fs', 'ярд/фс', 'ярдвфемтосекунду', 'ярдоввфемтосекунду', 'ярдвфсек', 'ярдвфс', 'ярдоввфсек', 'ярдоввфс']
    },
    ft_fs: {
        r: '3.281 / 1000000000000000',
        query: ['fpfs', 'feet/fs', 'фут/фс', 'футвфемтосекунду', 'футоввфемтосекунду', 'футвфсек', 'футвфс', 'футоввфсек', 'футоввфс']
    },
    in_fs: {
        r: '39.37 / 1000000000000000',
        query: ['inpfs', 'inches/fs', 'дюйм/фс', 'дюймвфемтосекунду', 'дюймоввфемтосекунду', 'дюймвфсек', 'дюймвфс', 'дюймоввфсек', 'дюймоввфс']
    },
    nm_ps: {
        r: '1000000000 / 1000000000000',
        query: ['nm/ps', 'нм/пс', 'нанометроввпикосекунду', 'нмвпсек', 'нмвпс']
    },
    mcm_ps: {
        r: '1000000 / 1000000000000',
        query: ['mcm/ps', 'мкм/пс', 'микронвпикосекунду', 'микрометроввпикосекунду', 'мкмвпсек', 'мкмвпс']
    },
    mm_ps: {
        r: '1000 / 1000000000000',
        query: ['mm/ps', 'мм/пс', 'миллиметроввпикосекунду', 'ммвпсек', 'ммвпс']
    },
    cm_ps: {
        r: '100 / 1000000000000',
        query: ['cm/ps', 'см/пс', 'сантиметроввпикосекунду', 'смвпсек', 'смвпс']
    },
    dm_ps: {
        r: '10 / 1000000000000',
        query: ['dm/ps', 'дм/пс', 'дециметроввпикосекунду', 'дмвпсек', 'дмвпс']
    },
    m_ps: {
        r: '1 / 1000000000000',
        query: ['m/ps', 'м/пс', 'метроввпикосекунду', 'мвпсек', 'мвпс']
    },
    km_ps: {
        r: '(1 / 1000) / 1000000000000',
        query: ['km/ps', 'км/пс', 'километроввпикосекунду', 'кмвпсек', 'кмвпс']
    },
    mi_ps: {
        r: '(1 / 1609) / 1000000000000',
        query: ['mpps', 'miles/ps', 'миль/пс', 'мильвпикосекунду', 'мильвпсек', 'мильвпс']
    },
    yd_ps: {
        r: '1.094 / 1000000000000',
        query: ['ypps', 'yards/ps', 'ярд/пс', 'ярдвпикосекунду', 'ярдоввпикосекунду', 'ярдвпсек', 'ярдвпс', 'ярдоввпсек', 'ярдоввпс']
    },
    ft_ps: {
        r: '3.281 / 1000000000000',
        query: ['fpps', 'feet/ps', 'фут/пс', 'футвпикосекунду', 'футоввпикосекунду', 'футвпсек', 'футвпс', 'футоввпсек', 'футоввпс']
    },
    in_ps: {
        r: '39.37 / 1000000000000',
        query: ['inpps', 'inches/ps', 'дюйм/пс', 'дюймвпикосекунду', 'дюймоввпикосекунду', 'дюймвпсек', 'дюймвпс', 'дюймоввпсек', 'дюймоввпс']
    },
    nm_ns: {
        r: '1000000000 / 1000000000',
        query: ['nm/ns', 'нм/нс', 'нанометроввнаносекунду', 'нмвнсек', 'нмвнс']
    },
    mcm_ns: {
        r: '1000000 / 1000000000',
        query: ['mcm/ns', 'мкм/нс', 'микронвнаносекунду', 'микрометроввнаносекунду', 'мкмвнсек', 'мкмвнс']
    },
    mm_ns: {
        r: '1000 / 1000000000',
        query: ['mm/ns', 'мм/нс', 'миллиметроввнаносекунду', 'ммвнсек', 'ммвнс']
    },
    cm_ns: {
        r: '100 / 1000000000',
        query: ['cm/ns', 'см/нс', 'сантиметроввнаносекунду', 'смвнсек', 'смвнс']
    },
    dm_ns: {
        r: '10 / 1000000000',
        query: ['dm/ns', 'дм/нс', 'дециметроввнаносекунду', 'дмвнсек', 'дмвнс']
    },
    m_ns: {
        r: '1 / 1000000000',
        query: ['m/ns', 'м/нс', 'метроввнаносекунду', 'мвнсек', 'мвнс']
    },
    km_ns: {
        r: '(1 / 1000) / 1000000000',
        query: ['km/ns', 'км/нс', 'километроввнаносекунду', 'кмвнсек', 'кмвнс']
    },
    mi_ns: {
        r: '(1 / 1609) / 1000000000',
        query: ['mpns', 'miles/ns', 'миль/нс', 'мильвнаносекунду', 'мильвнсек', 'мильвнс']
    },
    yd_ns: {
        r: '1.094 / 1000000000',
        query: ['ypns', 'yards/ns', 'ярд/нс', 'ярдвнаносекунду', 'ярдоввнаносекунду', 'ярдвнсек', 'ярдвнс', 'ярдоввнсек', 'ярдоввнс']
    },
    ft_ns: {
        r: '3.281 / 1000000000',
        query: ['fpns', 'feet/ns', 'фут/нс', 'футвнаносекунду', 'футоввнаносекунду', 'футвнсек', 'футвнс', 'футоввнсек', 'футоввнс']
    },
    in_ns: {
        r: '39.37 / 1000000000',
        query: ['inpns', 'inches/ns', 'дюйм/нс', 'дюймвнаносекунду', 'дюймоввнаносекунду', 'дюймвнсек', 'дюймвнс', 'дюймоввнсек', 'дюймоввнс']
    },
    nm_micros: {
        r: '1000000000 / 1000000',
        query: ['nm/micros', 'nm/mcs', 'нм/микрос', 'нанометроввмикросекунду', 'нмвмикросек', 'нмвмкс']
    },
    mcm_micros: {
        r: '1000000 / 1000000',
        query: ['mcm/micros', 'mcm/mcs', 'мкм/микрос', 'микронвмикросекунду', 'микрометроввмикросекунду', 'мкмвмикросек', 'мкмвмкс']
    },
    mm_micros: {
        r: '1000 / 1000000',
        query: ['mm/micros', 'mcm/mcs', 'мм/микрос', 'миллиметроввмикросекунду', 'ммвмикросек', 'ммвмкс']
    },
    cm_micros: {
        r: '100 / 1000000',
        query: ['cm/micros', 'cm/mcs', 'см/микрос', 'сантиметроввмикросекунду', 'смвмикросек', 'смвмкс']
    },
    dm_micros: {
        r: '10 / 1000000',
        query: ['dm/micros', 'dm/mcs', 'дм/микрос', 'дециметроввмикросекунду', 'дмвмикросек', 'дмвмкс']
    },
    m_micros: {
        r: '1 / 1000000',
        query: ['m/micros', 'm/mcs', 'м/микрос', 'метроввмикросекунду', 'мвмикросек', 'мвмкс']
    },
    km_micros: {
        r: '(1 / 1000) / 1000000',
        query: ['km/micros', 'km/mcs', 'км/мкс', 'километроввмикросекунду', 'кмвмикросек', 'кмвмкс']
    },
    mi_micros: {
        r: '(1 / 1609) / 1000000',
        query: ['mpmicros', 'miles/micros', 'miles/mcs', 'миль/мкс', 'мильвмикросекунду', 'мильвмикросек', 'мильвмкс']
    },
    yd_micros: {
        r: '1.094 / 1000000',
        query: ['ypmicros', 'yards/micros', 'yards/mcs', 'ярд/мкс', 'ярдвмикросекунду', 'ярдоввмикросекунду', 'ярдвмикросек', 'ярдвмкс', 'ярдоввмикросек', 'ярдоввмкс']
    },
    ft_micros: {
        r: '3.281 / 1000000',
        query: ['fpmicros', 'feet/micros', 'yards/mcs', 'фут/мкс', 'футвмикросекунду', 'футоввмикросекунду', 'футвмикросек', 'футвмкс', 'футоввмикросек', 'футоввмкс']
    },
    in_micros: {
        r: '39.37 / 1000000',
        query: ['inpmicros', 'inches/micros', 'inches/mcs', 'дюйм/мкс', 'дюймвмикросекунду', 'дюймоввмикросекунду', 'дюймвмикросек', 'дюймвмкс', 'дюймоввмикросек', 'дюймоввмкс']
    },
    nm_ms: {
        r: '1000000000 / 1000',
        query: ['nm/ms', 'нм/мс', 'нанометроввмиллисекунду', 'нмвмсек', 'нмвмс']
    },
    mcm_ms: {
        r: '1000000 / 1000',
        query: ['mcm/ms', 'мкм/мс', 'микронвмиллисекунду', 'микрометроввмиллисекунду', 'мкмвмсек', 'мкмвмс']
    },
    mm_ms: {
        r: '1000 / 1000',
        query: ['mm/ms', 'мм/мс', 'миллиметроввмиллисекунду', 'ммвмсек', 'ммвмс']
    },
    cm_ms: {
        r: '100 / 1000',
        query: ['cm/ms', 'см/мс', 'сантиметроввмиллисекунду', 'смвмсек', 'смвмс']
    },
    dm_ms: {
        r: '10 / 1000',
        query: ['dm/ms', 'дм/мс', 'дециметроввмиллисекунду', 'дмвмсек', 'дмвмс']
    },
    m_ms: {
        r: '1 / 1000',
        query: ['m/ms', 'м/мс', 'метроввмиллисекунду', 'мвмсек', 'мвмс']
    },
    km_ms: {
        r: '(1 / 1000) / 1000',
        query: ['km/ms', 'км/мс', 'километроввмиллисекунду', 'кмвмсек', 'кмвмс']
    },
    mi_ms: {
        r: '(1 / 1609) / 1000',
        query: ['mpms', 'miles/ms', 'миль/мс', 'мильвмиллисекунду', 'мильвмсек', 'мильвмс']
    },
    yd_ms: {
        r: '1.094 / 1000',
        query: ['ypms', 'yards/ms', 'ярд/мс', 'ярдвмиллисекунду', 'ярдоввмиллисекунду', 'ярдвмсек', 'ярдвмс', 'ярдоввмсек', 'ярдоввмс']
    },
    ft_ms: {
        r: '3.281 / 1000',
        query: ['fpms', 'feet/ms', 'фут/мс', 'футвмиллисекунду', 'футоввмиллисекунду', 'футвмсек', 'футвмс', 'футоввмсек', 'футоввмс']
    },
    in_ms: {
        r: '39.37 / 1000',
        query: ['inpms', 'inches/ms', 'дюйм/мс', 'дюймвмиллисекунду', 'дюймоввмиллисекунду', 'дюймвмсек', 'дюймвмс', 'дюймоввмсек', 'дюймоввмс']
    },
    nm_s: {
        r: '1000000000 / 1',
        query: ['nm/s', 'nm/sec', 'nms', 'nmsec', 'нм/с', 'нм/сек', 'нанометроввсекунду', 'нмвсек', 'нмвс', 'нмс']
    },
    mcm_s: {
        r: '1000000 / 1',
        query: ['mcm/s', 'mcm/sec', 'mcms', 'mcmsec', 'мкм/с', 'мкм/сек', 'микронвсекунду', 'микрометроввсекунду', 'мкмвсек', 'мкмвс', 'мкмс']
    },
    mm_s: {
        r: '1000 / 1',
        query: ['mm/s', 'mm/sec', 'mms', 'mmsec', 'мм/с', 'мм/сек', 'миллиметроввсекунду', 'ммвсек', 'ммвс', 'ммс']
    },
    cm_s: {
        r: '100 / 1',
        query: ['cm/s', 'cm/sec', 'cms', 'cmsec', 'см/с', 'см/сек', 'сантиметроввсекунду', 'смвсек', 'смвс', 'смс']
    },
    dm_s: {
        r: '10 / 1',
        query: ['dm/s', 'dm/sec', 'dms', 'dmsec', 'дм/с', 'дм/сек', 'дециметроввсекунду', 'дмвсек', 'дмвс', 'дмс']
    },
    m_s: {
        r: '1 / 1',
        query: ['m/s', 'm/sec', 'ms', 'msec', 'м/с', 'м/сек', 'метроввсекунду', 'мвсек', 'мвс', 'мс']
    },
    km_s: {
        r: '(1 / 1000) / 1',
        query: ['km/s', 'km/sec', 'kms', 'kmsec', 'км/с', 'км/сек', 'километроввсекунду', 'кмвсек', 'кмвс', 'кмс']
    },
    mi_s: {
        r: '(1 / 1609) / 1',
        query: ['mps', 'mi/sec', 'miles/s', 'msec', 'misec', 'miless', 'миль/с', 'миль/сек', 'мильвсекунду', 'мильвсек', 'мильвс', 'мильс']
    },
    yd_s: {
        r: '1.094 / 1',
        query: ['yps', 'yards/sec', 'yards/s', 'yardssec', 'yardss', 'ярд/с', 'ярд/сек', 'ярдвсекунду', 'ярдоввсекунду', 'ярдвсек', 'ярдвс', 'ярдоввсек', 'ярдоввс', 'ярдс']
    },
    ft_s: {
        r: '3.281 / 1',
        query: ['fps', 'feet/sec', 'feet/s', 'feetsec', 'feets', 'фут/с', 'фут/сек', 'футвсекунду', 'футоввсекунду', 'футвсек', 'футвс', 'футоввсек', 'футоввс', 'футс']
    },
    in_s: {
        r: '39.37 / 1',
        query: ['inps', 'inches/sec', 'inches/s', 'inchessec', 'inchess', 'дюйм/с', 'дюйм/сек', 'дюймвсекунду', 'дюймоввсекунду', 'дюймвсек', 'дюймвс', 'дюймоввсек', 'дюймоввс', 'дюймс']
    },
    nm_min: {
        r: '1000000000 / (1 / (1 / 60))',
        query: ['nm/min', 'nm/m', 'nmmin', 'nmm', 'нм/мин', 'нм/минут', 'нанометроввминуту', 'нмвмин', 'нмвминуту', 'нммин']
    },
    mcm_min: {
        r: '1000000 / (1 / (1 / 60))',
        query: ['mcm/min', 'mcm/m', 'mcmmin', 'mcmm', 'мкм/мин', 'мкм/минут', 'микронвминуту', 'микрометроввминуту', 'мкмвмин', 'мкмвминуту', 'мкммин']
    },
    mm_min: {
        r: '1000 / (1 / (1 / 60))',
        query: ['mm/min', 'mm/m', 'mmmin', 'mmm', 'мм/мин', 'мм/минут', 'миллиметроввминуту', 'ммвмин', 'ммвминуту', 'мммин']
    },
    cm_min: {
        r: '100 / (1 / (1 / 60))',
        query: ['cm/min', 'cm/m', 'cmmin', 'cmm', 'см/мин', 'см/минут', 'сантиметроввминуту', 'смвмин', 'смвминуту', 'сммин']
    },
    dm_min: {
        r: '10 / (1 / (1 / 60))',
        query: ['dm/min', 'dm/m', 'dmmin', 'dmm', 'дм/мин', 'дм/минут', 'дециметроввминуту', 'дмвмин', 'дмвминуту', 'дммин']
    },
    m_min: {
        r: '1 / (1 / (1 / 60))',
        query: ['m/min', 'm/m', 'mmin', 'mm', 'м/мин', 'м/минут', 'метроввминуту', 'мвмин', 'мвминуту', 'ммин']
    },
    km_min: {
        r: '(1 / 1000) / (1 / (1 / 60))',
        query: ['km/min', 'km/m', 'kmmin', 'kmm', 'км/мин', 'км/минут', 'километроввминуту', 'кмвмин', 'кмвминуту', 'кммин']
    },
    mi_min: {
        r: '(1 / 1609) / (1 / (1 / 60))',
        query: ['mpmin', 'mi/m', 'mim', 'mpm', 'miles/min', 'milesmin', 'миль/мин', 'миль/минут', 'мильвминуту', 'мильвмин', 'мильвминуту', 'мимин']
    },
    yd_min: {
        r: '1.094 / (1 / (1 / 60))',
        query: ['ypmin', 'yd/m', 'ydm', 'ypm', 'yards/min', 'yardsmin', 'ярд/мин', 'ярд/минут', 'ярдвминуту', 'ярдоввминуту', 'ярдвмин', 'ярдвминут', 'ярдоввминут', 'ярдоввмин', 'ярдмин']
    },
    ft_min: {
        r: '3.281 / (1 / (1 / 60))',
        query: ['fpmin', 'ft/m', 'ftm', 'fpm', 'feet/min', 'feetmin', 'фут/мин', 'фут/минут', 'футвминуту', 'футоввминуту', 'футвмин', 'футвминут', 'футоввмин', 'футоввминут', 'футмин']
    },
    in_min: {
        r: '39.37 / (1 / (1 / 60))',
        query: ['inps', 'in/m', 'inches/s', 'inm', 'inchess', 'дюйм/с', 'дюйм/сек', 'дюймвсекунду', 'дюймоввсекунду', 'дюймвсек', 'дюймвс', 'дюймоввсек', 'дюймоввс', 'дюйммин']
    },
    nm_hour: {
        r: '1000000000 / (1 / (60 * 60))',
        query: ['nm/hour', 'nm/h', 'nmhour', 'nmh', 'нм/ч', 'нм/час', 'нанометроввчас', 'нмвчас', 'нмвч', 'нмчас', 'нм час']
    },
    mcm_hour: {
        r: '1000000 / (1 / (60 * 60))',
        query: ['mcm/hour', 'mcm/h', 'mcmhour', 'mcmh', 'мкм/ч', 'мкм/час', 'микронвчас', 'микрометроввчас', 'мкмвч', 'мкмвчас', 'мкмчас', 'мкм час']
    },
    mm_hour: {
        r: '1000 / (1 / (60 * 60))',
        query: ['mm/hour', 'mm/h', 'mmhour', 'mmh', 'мм/ч', 'мм/час', 'миллиметроввчас', 'ммвчас', 'ммвч', 'ммчас', 'мм час']
    },
    cm_hour: {
        r: '100 / (1 / (60 * 60))',
        query: ['cm/hour', 'cm/h', 'cmhour', 'cmh', 'см/ч', 'см/час', 'сантиметроввчас', 'смвчас', 'смвч', 'смчас', 'см час']
    },
    dm_hour: {
        r: '10 / (1 / (60 * 60))',
        query: ['dm/hour', 'dm/h', 'dmhour', 'dmh', 'дм/ч', 'дм/час', 'дециметроввчас', 'дмвчас', 'дмвч', 'дмчас', 'дм час']
    },
    m_hour: {
        r: '1 / (1 / (60 * 60))',
        query: ['m/hour', 'm/h', 'mhour', 'mh', 'м/ч', 'м/час', 'метроввчас', 'мвчас', 'мвч', 'мчас','м час']
    },
    km_hour: {
        r: '(1 / 1000) / (1 / (60 * 60))',
        query: ['km/hour', 'km/h', 'kmhour', 'kmh', 'км/час', 'км/ч', 'километроввчас', 'кмвчас', 'кмвч', 'кмчас','км час']
    },
    mi_hour: {
        r: '(1 / 1609) / (1 / (60 * 60))',
        query: ['mphour', 'mi/h', 'mih', 'mph', 'miles/h', 'milesh', 'миль/час', 'миль/ч', 'мильвчас', 'мильвч', 'мичас']
    },
    yd_hour: {
        r: '1.094 / (1 / (60 * 60))',
        query: ['yph', 'yphour', 'yd/h', 'yards/h', 'ydh', 'yardsh', 'ярд/час', 'ярд/ч', 'ярдвчас', 'ярдоввчас', 'ярдвч', 'ярдоввч', 'ярдчас', 'ярд час']
    },
    ft_hour: {
        r: '3.281 / (1 / (60 * 60))',
        query: ['fph', 'fphour', 'ft/h', 'feet/h', 'fth', 'feeth', 'фут/час', 'фут/ч', 'футвчас', 'футоввчас', 'футвч', 'футоввч', 'футчас', 'фут час']
    },
    in_hour: {
        r: '39.37 / (1 / (60 * 60))',
        query: ['inph', 'inches/h', 'in/h', 'inchesh', 'inh', 'дюйм/ч', 'дюйм/час', 'дюймвчас', 'дюймоввчас', 'дюймвч', 'дюймоввч', 'дюймчас', 'дюйм час']
    },
    nm_day: {
        r: '1000000000 / (1 / (86400))',
        query: ['nm/day', 'nm/d', 'nmday', 'nmd', 'нм/д', 'нм/день', 'нанометроввдень', 'нмвдень', 'нмвд', 'нмд']
    },
    mcm_day: {
        r: '1000000 / (1 / (86400))',
        query: ['mcm/day', 'mcm/d', 'mcmday', 'mcmd', 'мкм/д', 'мкм/день', 'микронвдень', 'микрометроввдень', 'мкмвд', 'мкмвдень', 'мкмд']
    },
    mm_day: {
        r: '1000 / (1 / (86400))',
        query: ['mm/day', 'mm/d', 'mmday', 'mmd', 'мм/д', 'мм/день', 'миллиметроввдень', 'ммвдень', 'ммвд', 'ммд']
    },
    cm_day: {
        r: '100 / (1 / (86400))',
        query: ['cm/day', 'cm/d', 'cmday', 'cmd', 'см/д', 'см/день', 'сантиметроввдень', 'смвдень', 'смвд', 'смд']
    },
    dm_day: {
        r: '10 / (1 / (86400))',
        query: ['dm/day', 'dm/d', 'dmday', 'dmd', 'дм/д', 'дм/день', 'дециметроввдень', 'дмвдень', 'дмвд', 'дмд']
    },
    m_day: {
        r: '1 / (1 / (86400))',
        query: ['m/day', 'm/d', 'mday', 'md', 'м/д', 'м/день', 'метроввдень', 'мвдень', 'мвд', 'мд']
    },
    km_day: {
        r: '(1 / 1000) / (1 / (86400))',
        query: ['km/day', 'km/d', 'kmday', 'kmd', 'км/д', 'км/день', 'километроввдень', 'кмвдень', 'кмвд', 'кмд']
    },
    mi_day: {
        r: '(1 / 1609) / (1 / (86400))',
        query: ['mpday', 'mi/d', 'mid', 'mpd', 'miles/d', 'milesd', 'миль/день', 'миль/д', 'мильвдень', 'мильвд', 'мид']
    },
    yd_day: {
        r: '1.094 / (1 / (86400))',
        query: ['ypd', 'ypday', 'yd/d', 'yards/d', 'ydd', 'yardsd', 'ярд/день', 'ярд/д', 'ярдвдень', 'ярдоввдень', 'ярдвд', 'ярдоввд', 'ярдд']
    },
    ft_day: {
        r: '3.281 / (1 / (86400))',
        query: ['fpd', 'fpday', 'ft/d', 'feet/d', 'ftd', 'feetd', 'фут/день', 'фут/д', 'футвдень', 'футоввдень', 'футвд', 'футоввд', 'футд']
    },
    in_day: {
        r: '39.37 / (1 / (86400))',
        query: ['inpd', 'inches/d', 'in/d', 'inchesd', 'ind', 'дюйм/д', 'дюйм/день', 'дюймвдень', 'дюймоввдень', 'дюймвд', 'дюймоввд', 'дюймд']
    },
    nm_week: {
        r: '1000000000 / (1 / (7 * 24 * 60 * 60))',
        query: ['nm/w', 'nm/week', 'nmw', 'nmweek', 'nmw', 'нм/н', 'нм/недель', 'нм/неделю', 'нанометроввнеделю', 'нмвнеделю', 'нмвн', 'нмнед']
    },
    mcm_week: {
        r: '1000000 / (1 / (7 * 24 * 60 * 60))',
        query: ['mcm/w', 'mcm/week', 'mcmw', 'mcmweek', 'мкм/н', 'мкм/недель', 'мкм/неделю', 'микронвнеделю', 'микрометроввнеделю', 'мкмвн', 'мкмвнеделю', 'мкмнед']
    },
    mm_week: {
        r: '1000 / (1 / (7 * 24 * 60 * 60))',
        query: ['mm/w', 'mm/week', 'mmw', 'mmweek', 'мм/н', 'мм/недель', 'мм/неделю', 'миллиметроввнеделю', 'ммвнеделю', 'ммвн', 'ммнед']
    },
    cm_week: {
        r: '100 / (1 / (7 * 24 * 60 * 60))',
        query: ['cm/w', 'cm/week', 'cmw', 'cmweek', 'см/н', 'см/недель', 'см/неделю', 'сантиметроввнеделю', 'смвнеделю', 'смвн', 'смнед']
    },
    dm_week: {
        r: '10 / (1 / (7 * 24 * 60 * 60))',
        query: ['dm/w', 'dm/week', 'dmw', 'dmweek', 'дм/н', 'дм/недель', 'дм/неделю', 'дециметроввнеделю', 'дмвнеделю', 'дмвн', 'дмнед']
    },
    m_week: {
        r: '1 / (1 / (7 * 24 * 60 * 60))',
        query: ['m/w', 'm/week', 'mw', 'mweek', 'м/н', 'м/недель', 'м/неделю', 'метроввнеделю', 'мвнеделю', 'мвн', 'мнед']
    },
    km_week: {
        r: '(1 / 1000) / (1 / (7 * 24 * 60 * 60))',
        query: ['km/w', 'km/week', 'kmw', 'kmweek', 'км/н', 'км/недель', 'км/неделю', 'километроввнеделю', 'кмвнеделю', 'кмвн', 'кмнед']
    },
    mi_week: {
        r: '(1 / 1609) / (1 / (7 * 24 * 60 * 60))',
        query: ['mpw', 'mpweek', 'mi/w', 'miles/w', 'miw', 'milesw', 'миль/недель', 'миль/неделю', 'миль/н', 'мильвнеделю', 'мильвн', 'минед']
    },
    yd_week: {
        r: '1.094 / (1 / (7 * 24 * 60 * 60))',
        query: ['ypw', 'ypweek', 'yards/w', 'yd/w', 'yardsw', 'ydw', 'ярд/недель', 'ярд/неделю', 'ярд/н', 'ярдвнеделю', 'ярдоввнеделю', 'ярдвн', 'ярдоввн', 'ярднед']
    },
    ft_week: {
        r: '3.281 / (1 / (7 * 24 * 60 * 60))',
        query: ['fpw', 'fpweek', 'feet/w', 'ft/w', 'feetw', 'ftw', 'фут/недель', 'фут/неделю', 'фут/н', 'футвнеделю', 'футоввнеделю', 'футвн', 'футоввн', 'футнед']
    },
    in_week: {
        r: '39.37 / (1 / (7 * 24 * 60 * 60))',
        query: ['inpw', 'inpweek', 'inches/w', 'in/w', 'inchesw', 'inw', 'дюйм/недель', 'дюйм/неделю', 'дюйм/н', 'дюймвнеделю', 'дюймоввнеделю', 'дюймвн', 'дюймоввн', 'дюймнед']
    },
    nm_month: {
        r: '1000000000 / (1 / (43800 * 60))',
        query: ['nm/mon', 'nm/month', 'nmmon', 'nmmonth', 'нм/мес', 'нм/месяц', 'нанометроввмесяц', 'нмвмесяц', 'нмвмес', 'нммес']
    },
    mcm_month: {
        r: '1000000 / (1 / (43800 * 60))',
        query: ['mcm/mon', 'mcm/month', 'mcmmon', 'mcmmonth', 'мкм/мес', 'мкм/месяц', 'микронвмесяц', 'микрометроввмесяц', 'мкмвмесяц', 'мкмвмес', 'мкммес']
    },
    mm_month: {
        r: '1000 / (1 / (43800 * 60))',
        query: ['mm/mon', 'mm/month', 'mmmon', 'mmmonth', 'мм/мес', 'мм/месяц', 'миллиметроввмесяц', 'ммвмесяц', 'ммвмес', 'мммес']
    },
    cm_month: {
        r: '100 / (1 / (43800 * 60))',
        query: ['cm/mon', 'cm/month', 'cmmon', 'cmmonth', 'см/мес', 'см/месяц', 'сантиметроввмесяц', 'смвмесяц', 'смвмес', 'сммес']
    },
    dm_month: {
        r: '10 / (1 / (43800 * 60))',
        query: ['dm/mon', 'dm/month', 'dmmon', 'dmmonth', 'дм/мес', 'дм/месяц', 'дециметроввмесяц', 'дмвмесяц', 'дмвмес', 'дммес']
    },
    m_month: {
        r: '1 / (1 / (43800 * 60))',
        query: ['m/mon', 'm/month', 'mmon', 'mmonth', 'м/мес', 'м/месяц', 'метроввмесяц', 'мвмесяц', 'мвмес', 'ммес']
    },
    km_month: {
        r: '(1 / 1000) / (1 / (43800 * 60))',
        query: ['km/mon', 'km/month', 'kmmon', 'kmmonth', 'км/мес', 'км/месяц', 'километроввмесяц', 'кмвмесяц', 'кмвмес', 'кммес']
    },
    mi_month: {
        r: '(1 / 1609) / (1 / (43800 * 60))',
        query: ['mpmon', 'mpmonth', 'miles/month', 'mil/month', 'milesmonth', 'milmonth', 'миль/месяц', 'миль/мес', 'мильвмесяц', 'мильвмес', 'мимес']
    },
    yd_month: {
        r: '1.094 / (1 / (43800 * 60))',
        query: ['ypmon', 'ypmonth', 'yards/month', 'yd/month', 'yardsmonth', 'ydmonth', 'ярд/месяц', 'ярд/мес', 'ярдвмесяц', 'ярдоввмесяц', 'ярдвмес', 'ярдоввмес', 'ярдмес']
    },
    ft_month: {
        r: '3.281 / (1 / (43800 * 60))',
        query: ['fpmon', 'fpmonth', 'feet/month', 'ft/month', 'feetmonth', 'ftmonth', 'фут/месяц', 'фут/мес', 'футвмесяц', 'футоввмесяц', 'футвмес', 'футоввмес', 'футмес']
    },
    in_month: {
        r: '39.37 / (1 / (43800 * 60))',
        query: ['inpmon', 'inpmonth', 'inches/month', 'in/month', 'inchesmonth', 'inmonth', 'дюйм/месяц', 'дюйм/мес', 'дюймвмесяц', 'дюймоввмесяц', 'дюймвмес', 'дюймоввмес', 'дюйммес']
    },
    nm_year: {
        r: '1000000000 / (1 / 31536000)',
        query: ['nm/y', 'nm/year', 'nmy', 'nmyear', 'нм/г', 'нм/год', 'нанометроввгод', 'нмвгод', 'нмвг', 'нмгод']
    },
    mcm_year: {
        r: '1000000 / (1 / 31536000)',
        query: ['mcm/y', 'mcm/year', 'mcmy', 'mcmyear', 'мкм/г', 'мкм/год', 'микронвгод', 'микрометроввгод', 'мкмвгод', 'мкмвг', 'мкмгод']
    },
    mm_year: {
        r: '1000 / (1 / 31536000)',
        query: ['mm/y', 'mm/year', 'mmy', 'mmyear', 'мм/г', 'мм/год', 'миллиметроввгод', 'ммвг', 'ммвгод', 'ммгод']
    },
    cm_year: {
        r: '100 / (1 / 31536000)',
        query: ['cm/y', 'cm/year', 'cmy', 'cmyear', 'см/г', 'см/год', 'сантиметроввгод', 'смвг', 'смвгод', 'смгод']
    },
    dm_year: {
        r: '10 / (1 / 31536000)',
        query: ['dm/y', 'dm/year', 'dmy', 'dmyear', 'дм/г', 'дм/год', 'дециметроввгод', 'дмвг', 'дмвгод', 'дмгод']
    },
    m_year: {
        r: '1 / (1 / 31536000)',
        query: ['m/y', 'm/year', 'my', 'myear', 'м/г', 'м/год', 'метроввгод', 'мвг', 'мвгод', 'мгод']
    },
    km_year: {
        r: '(1 / 1000) / (1 / 31536000)',
        query: ['km/y', 'km/year', 'kmy', 'kmyear', 'км/г', 'км/год', 'километроввгод', 'кмвг', 'кмвгод', 'кмгод']
    },
    mi_year: {
        r: '(1 / 1609) / (1 / 31536000)',
        query: ['mpy', 'mpyear', 'miles/year', 'mil/year', 'milesyear', 'milyear', 'миль/г', 'миль/год', 'мильвг', 'мильвгод', 'мигод']
    },
    yd_year: {
        r: '1.094 / (1 / 31536000)',
        query: ['ypy', 'ypyear', 'yards/year', 'yd/year', 'yardsyear', 'ydyear', 'ярд/г', 'ярд/год', 'ярдвг', 'ярдоввг', 'ярдвгод', 'ярдоввгод', 'ярдгод']
    },
    ft_year: {
        r: '3.281 / (1 / 31536000)',
        query: ['fpy', 'fpyear', 'feet/year', 'ft/year', 'feetyear', 'ftyear', 'фут/г', 'фут/год', 'футвг', 'футоввг', 'футвгод', 'футоввгод', 'футгод']
    },
    in_year: {
        r: '39.37 / (1 / 31536000)',
        query: ['inpy', 'inpyear', 'inches/year', 'in/year', 'inchesyear', 'inyear', 'дюйм/г', 'дюйм/год', 'дюймвг', 'дюймоввг', 'дюймвгод', 'дюймоввгод', 'дюймгод']
    },
    nm_century: {
        r: '1000000000 / (1 / 3153600000)',
        query: ['nm/cen', 'nm/century', 'nmcen', 'nmcentury', 'нм/в', 'нм/век', 'нанометровввек', 'нмввек', 'нмвв', 'нмвек']
    },
    mcm_century: {
        r: '1000000 / (1 / 3153600000)',
        query: ['mcm/cen', 'mcm/century', 'mcmcen', 'mcmcentury', 'мкм/в', 'мкм/век', 'микронввек', 'микрометровввек', 'мкмввек', 'мкмвв', 'мкмвек']
    },
    mm_century: {
        r: '1000 / (1 / 3153600000)',
        query: ['mm/cen', 'mm/century', 'mmcen', 'mmcentury', 'мм/в', 'мм/век', 'миллиметровввек', 'ммввек', 'ммвв', 'ммвек']
    },
    cm_century: {
        r: '100 / (1 / 3153600000)',
        query: ['cm/cen', 'cm/century', 'cmcen', 'cmcentury', 'см/в', 'см/век', 'сантиметровввек', 'смввек', 'смвв', 'смвек']
    },
    dm_century: {
        r: '10 / (1 / 3153600000)',
        query: ['dm/cen', 'dm/century', 'dmcen', 'dmcentury', 'дм/в', 'дм/век', 'дециметровввек', 'дмввек', 'дмвв', 'дмвек']
    },
    m_century: {
        r: '1 / (1 / 3153600000)',
        query: ['m/cen', 'm/century', 'mcen', 'mcentury', 'м/в', 'м/век', 'метровввек', 'мввек', 'мвв', 'мвек']
    },
    km_century: {
        r: '(1 / 1000) / (1 / 3153600000)',
        query: ['km/cen', 'km/century', 'kmcen', 'kmcentury', 'км/в', 'км/век', 'километровввек', 'кмввек', 'кмвв', 'кмвек']
    },
    mi_century: {
        r: '(1 / 1609) / (1 / 3153600000)',
        query: ['mpcen', 'mpcentury', 'miles/cen', 'mil/cen', 'miles/century', 'milescen', 'milcen', 'milescentury', 'milcentury', 'миль/в', 'миль/век', 'мильвв', 'мильввек', 'мивек']
    },
    yd_century: {
        r: '1.094 / (1 / 3153600000)',
        query: ['ypcen', 'ypcentury', 'yards/cen', 'yards/century', 'yd/cen', 'yd/century', 'yardscen', 'yardscentury', 'ydcen', 'ydcentury', 'ярд/в', 'ярд/век', 'ярдвв', 'ярдоввв', 'ярдввек', 'ярдовввек', 'ярдвек']
    },
    ft_century: {
        r: '3.281 / (1 / 3153600000)',
        query: ['fpcen', 'fpcentury', 'feet/cen', 'feet/century', 'ft/cen', 'ft/century', 'feetcen', 'feetcentury', 'ftcen', 'ftcentury', 'фут/в', 'фут/век', 'футвв', 'футоввв', 'футввек', 'футовввек', 'футвек']
    },
    in_century: {
        r: '39.37 / (1 / 3153600000)',
        query: ['inpcen', 'inpcentury', 'inches/cen', 'inches/century', 'in/cen', 'in/century', 'inchescen', 'inchescentury', 'incen', 'incentury', 'дюйм/в', 'дюйм/век', 'дюймвв', 'дюймоввв', 'дюймввек', 'дюймовввек', 'дюймвек']
    }
}

module.exports = data;
