const data = {
    celsius: {
        r: [`9/5 * x + 32`,'(x - 32) * 5/9'],
        difference: true,
        query: [/^c(el(s(i(us|um)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?c(el(s(i(us|um)?)?)?)?$/i, 'cls', 'clss', '°C', '°С', /^ц(ел(ь(с(и|ия|иев|ии)?)?)?)?$/i, 'цл', 'цлс', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?ц(ел(ь(с(и|ия|иев|ии)?)?)?)?$/i]
    },
    fahrenheit: {
        r: '1',
        query: [/^f(a(h(r(en(h(ei(t(s)?)?)?)?)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?^f(a(h(r(en(h(ei(t(s)?)?)?)?)?)?)?)?$/i, 'fh', 'fhrt', '°F', '°Ф', /^ф(а(р(ен(г(е(й(т(ов|а|ы|е)?)?)?)?)?)?)?)?$/i, 'фг', 'фгт', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?ф(а(р(ен(г(е(й(т(ов|а|ы|е)?)?)?)?)?)?)?)?$/i]
    },
    kelvin: {
        r: ['9/5 * x - 459.67','(x + 459.67) * 5/9'],
        difference: true,
        query: [/^k(e(l(v(in(s)?)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?k(e(l(v(in(s)?)?)?)?)?$/i, 'kl', 'kls', 'K', 'К', /^к(е(л(ьв(ин(ов|а|ы|е)?)?)?)?)?$/i, 'кл', 'клв', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?к(е(л(ьв(ин(ов|а|ы|е)?)?)?)?)?$/i]
    },
    rankin: {
        r: ['x - 459.67','x + 459.67'],
        difference: true,
        query: [/^r(a(n(k(in(s)?)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?r(a(n(k(in(s)?)?)?)?)?$/i, 'rk', 'rks', '°R', '°Р', /^р(а(н(к(и(н(ов|а|ы|е)?)?)?)?)?)?$/i, 'рк', 'рнк', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?р(а(н(к(и(н(ов|а|ы|е)?)?)?)?)?)?$/i]
    },
    deg_newton: {
        r: ['x * 5.4545 + 32','(x - 32) * 0.18333'],
        difference: true,
        query: [/^n(e(w(t(o(n(s)?)?)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?n(e(w(t(o(n(s)?)?)?)?)?)?$/i, 'nt', 'nts', '°N', '°Н', /^н(ьют(он(ов|а|ы|е)?)?)?$/i, 'нт', 'нтн', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?н(ьют(он(ов|а|ы|е)?)?)?$/i]
    },
    reaumur: {
        r: ['x * 2.25 + 32','(x - 32) * 0.44444'],
        difference: true,
        query: [/^re(a(u(m(u(r(s)?)?)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?re(a(u(m(u(r(s)?)?)?)?)?)?$/i, 'rm', 'rms', '°Re', '°Ре', /^ре(о(м(ю(р(ов|а|ы|е)?)?)?)?)?$/i, 'рм', 'рмр', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?ре(о(м(ю(р(ов|а|ы|е)?)?)?)?)?$/i]
    },
    delisle: {
        r: ['(x + 100) * 1.2 + 32','(x - 32) * 0.83333 - 100'],
        difference: true,
        query: [/^d(e(l(i(s(l(e(s)?)?)?)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?d(e(l(i(s(l(e(s)?)?)?)?)?)?)?$/i, 'dl', 'dls', '°D', '°Д', /^д(е(л(и(л(ь|ев|я|ов|а|ы|е)?)?)?)?)?$/i, 'дл', 'длл', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?д(е(л(и(л(ь|ев|я|ов|а|ы|е)?)?)?)?)?$/i]
    },
    romer: {
        r: ['(x - 7.5) * 3.4286 + 32','(x - 32) * 0.29167 + 7.5'],
        difference: true,
        query: [/^ro(m(e(r(s)?)?)?)?$/i, /^d(eg(r(e(e(s)?)?)?)?)?\s?ro(m(e(r(s)?)?)?)?$/i, 'romr', 'roms', '°Ro', '°Ро', /^р(е|ё|о)?(м(е(р(ов|а|ы|е)?)?)?)?$/i, 'рм', 'рмр', /^г(р(а(д(у(с(ов|а|ы|е)?)?)?)?)?)?\s?р(е|ё|о)?(м(е(р(ов|а|ы|е)?)?)?)?$/i]
    }
}

module.exports = data;
