const data = {
    femtos: {
        r: '1000000000000000',
        query: [/^femtos(ec(ond(s)?)?)?$/i, 'fsec', 'fs', 'фс', /^фемтос(ек(унд(ы|а|у)?)?)?$/i]
    },
    picos: {
        r: '1000000000000',
        query: [/^picos(ec(ond(s)?)?)?$/i, 'psec', 'ps', 'пс', /^пикос(ек(унд(ы|а|у)?)?)?$/i]
    },
    nanos: {
        r: '1000000000',
        query: [/^nanos(ec(ond(s)?)?)?$/i, 'nsec', 'ns', 'нс', /^нанос(ек(унд(ы|а|у)?)?)?$/i]
    },
    micros: {
        r: '1000000',
        query: [/^micros(ec(ond(s)?)?)?$/i, 'micsec', 'mcs', 'µs', 'мкс', /^микрос(ек(унд(ы|а|у)?)?)?$/i]
    },
    millis: {
        r: '1000',
        query: [/^millis(ec(ond(s)?)?)?$/i, 'ms', 'milsec', 'мс', /^миллис(ек(унд(ы|а|у)?)?)?$/i]
    },
    sec: {
        r: '1',
        query: [/^s(ec(ond(s)?)?)?$/i, 'secs', 'ss', 's', /^с(ек(унд(ы|а|у)?)?)?$/i, 'сс', 'c', 'сек']
    },
    minut: {
        r: '1 / 60',
        query: [/^m(in(ute(s)?)?)?$/i, 'mins', 'm', 'min', /^м(ин(ут(а|ы|у)?)?)?$/i, 'м', 'мин']
    },
    hour: {
        r: '1 / (60 * 60)',
        query: [/^h(our(s)?)?$/i, 'hrs', 'hh', 'hs', 'h', /^ч(ас(ов|а|ы)?)?$/i, 'чч', 'ч']
    },
    day: {
        r: '1 / (24 * 60 * 60)',
        query: [/^d(ay(s)?)?$/i, 'dd', 'ds', 'd', 'д', /^д(ней|ень|ня)?$/i, 'дд']
    },
    week: {
        r: '1 / (7 * 24 * 60 * 60)',
        query: [/^w(eek(s)?)?$/i, 'wk', 'нд', 'w', 'н', /^н(ед(ел(я|и|ю|ь)?)?)?$/i, 'нед']
    },
    month: {
        r: '1 / (43800 * 60)',
        query: [/^mon(th(s)?)?$/i, 'mths', 'mth', 'мсц', 'мес', 'м', /^мес(яц(ов|ы|ев|а)?)?$/i]
    },
    year: {
        r: '1 / 31536000',
        query: [/^y(ear(s)?)?$/i, 'yrs', /^г(од(ов|а|ы)?)?$/i, 'гг', 'лет', 'г']
    },
    century: {
        r: '1 / 3153600000',
        query: [/^cen(t(ur(y|ies)?)?)?$/i, 'cntrs', 'cnt', 'вк', 'в', /^в(ек(ов|а)?)?$/i, /^столет(ия|ий|ие)?$/i]
    }
}

module.exports = data;
