const data = {
    fs: {
        r: 1000000000000000,
        query: [/^femtos(ec(ond(s)?)?)?$/i, 'fsec', 'fs', 'фс', /^фемтос(ек(унд(ы|а|у)?)?)?$/i]
    },
    ps: {
        r: 1000000000000,
        query: [/^picos(ec(ond(s)?)?)?$/i, 'psec', 'ps', 'пс', /^пикос(ек(унд(ы|а|у)?)?)?$/i]
    },
    ns: {
        r: 1000000000,
        query: [/^nanos(ec(ond(s)?)?)?$/i, 'nsec', 'ns', 'нс', /^нанос(ек(унд(ы|а|у)?)?)?$/i]
    },
    micros: {
        r: 1000000,
        query: [/^micros(ec(ond(s)?)?)?$/i, 'micsec', 'mcs', 'µs', 'мкс', /^микрос(ек(унд(ы|а|у)?)?)?$/i]
    },
    ms: {
        r: 1000,
        query: [/^millis(ec(ond(s)?)?)?$/i, 'ms', 'milsec', 'мс', /^миллис(ек(унд(ы|а|у)?)?)?$/i]
    },
    s: {
        r: 1,
        query: [/^s(ec(ond(s)?)?)?$/i, 'secs', 'ss', /^с(ек(унд(ы|а|у)?)?)?$/i, 'сс']
    },
    min: {
        r: 1 / 60,
        query: [/^min(ute(s)?)?$/i, 'mins', /^(мин(ут(а|ы|у)?)?)?$/i]
    },
    hour: {
        r: 1 / (60 * 60),
        query: [/^h(our(s)?)?$/i, 'hrs', 'hh', 'hs', /^ч(ас(ов|а|ы)?)?$/i, 'чч']
    },
    day: {
        r: 1 / (24 * 60 * 60),
        query: [/^d(ay(s)?)?$/i, 'dd', 'ds', /^д(ней|ень|ня)?$/i, 'дд']
    },
    week: {
        r: 1 / (7 * 24 * 60 * 60),
        query: [/^w(eek(s)?)?$/i, 'wk', 'нд', /^н(ед(ел(я|и|ю|ь)?)?)?$/i]
    },
    month: {
        r: 1 / (43800 * 60),
        query: [/^mon(th(s)?)?$/i, 'mths', 'mth', 'мсц', /^мес(яц(ов|ы|ев|а)?)?$/i]
    },
    year: {
        r: 0.00000003169,
        query: [/^y(ear(s)?)?$/i, 'yrs', /^г(од(ов|а|ы)?)?$/i, 'гг', 'лет']
    },
    century: {
        r: 0.0000000003169,
        query: [/^cen(t(ur(y|ies)?)?)?$/i, 'cntrs', 'cnt', 'вк', /^в(ек(ов|а)?)?$/i, /^столет(ия|ий|ие)?$/i]
    }
}

module.exports = data;
