const data = {
    cubic_metre_sec: {
        r: '1/1',
        query: ['m3sec', 'm3sec', 'cubicmetresec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*m(et(r(e(s)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'метркубвсек', 'м3сек', 'м3сек', /^кубометр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*с(е(к)?)?$/i,/^куб(ов|а|ы|е)\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_kilometre_sec: {
        r: '0.000000001/1',
        query: ['km3sec', 'km3sec', 'cubickilometresec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*k(ilo(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'километркубвсек', 'км3сек', 'км3сек', /^килокубометр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_decimetre_sec: {
        r: '1000/1',
        query: ['dm3sec', 'dm3sec', 'cubicdecimetresec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*d(eci(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'дециметркубвсек', 'дм3сек', 'дм3сек', /^децикубометр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_centimetre_sec: {
        r: '1000000/1',
        query: ['cm3sec', 'cm3sec', 'cubiccentimetresec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*c(enti(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'сантиметркубвсек', 'см3сек', 'см3сек', /^сантикубометр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_millimetre_sec: {
        r: '1000000000/1',
        query: ['mm3sec', 'mm3sec', 'cubicmillimetresec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mil(li(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'миллиметркубвсек', 'мм3сек', 'мм3сек', /^милликубометр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_mile_sec: {
        r: '0.0000000002399/1',
        query: ['mi3sec', 'mi3sec', 'cubicmilesec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mi(l(e(s)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'милякубвсек', 'миля3сек', 'миля3сек', 'миликубвсек', 'мили3сек', 'мили3сек', 'милькубвсек', 'миль3сек', 'миль3сек', /^ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_yard_sec: {
        r: '1.308/1',
        query: ['yd3sec', 'yd3sec', 'cubicyardsec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*ya(r(d(s)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'ярдкубвсек', 'ярд3сек', 'ярд3сек', 'ярдакубвсек', 'ярда3сек', 'ярда3сек', 'ярдовкубвсек', 'ярдов3сек', 'ярдов3сек', /^яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_feet_sec: {
        r: '35.31/1',
        query: ['ft3sec', 'ft3sec', 'cubicfeetsec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*fe(e(t(s)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'футкубвсек', 'фут3сек', 'фут3сек', 'футакубвсек', 'фута3сек', 'фута3сек', 'футовкубвсек', 'футов3сек', 'футов3сек', /^фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    cubic_inch_sec: {
        r: '61024/1',
        query: ['in3sec', 'in3sec', 'cubicinchsec', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*in(c(h(es)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'дюймкубвсек', 'дюйм3сек', 'дюйм3сек', 'дюймакубвсек', 'дюйма3сек', 'дюйма3сек', 'дюймовкубвсек', 'дюймов3сек', 'дюймов3сек', /^дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    hectolitre_sec: {
        r: '10/1',
        query: [/^(h|hect)(o(l(i(t(r(e(s)?)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'hcltsec', 'hlsec', /^гект(о(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'глсек']
    },
    decalitre_sec: {
        r: '100/1',
        query: [/^(d|deca)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'decaltsec', 'decalsec', /^дек(а(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'декалсек']
    },
    litre_sec: {
        r: '1000/1',
        query: [/^(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'ltsec', 'lsec', /^(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'лсек']
    },
    decilitre_sec: {
        r: '10000/1',
        query: [/^(d|deci)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'dcltsec', 'dlsec', /^деци(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'длсек']
    },
    centilitre_sec: {
        r: '100000/1',
        query: [/^(c|centi)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'cltsec', 'clsec', /^санти(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'слсек']
    },
    millilitre_sec: {
        r: '1000000/1',
        query: [/^(m|milli)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'mltsec', 'mlsec', /^милли(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'млсек']
    },
    microlitre_sec: {
        r: '1000000000/1',
        query: [/^(m|micro)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'mcltsec', 'mclsec', /^микро(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'мклсек']
    },
    gallon_usa_sec: {
        r: '264.2/1',
        query: [/^gal(lon(s)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'galssec', 'glnsec', 'галсек', /^гал(л(он(ов|а|ы|е)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'глсек']
    },
    pint_usa_sec: {
        r: '2113/1',
        query: [/^pint(s)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'ptssec', 'ptsec', /^пин(т(а|ы|е)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'птсек']
    },
    fluid_ounce_usa_sec: {
        r: '33814/1',
        query: [/^fl(u(id)?)?\s*(per|\/)?\s*o(un(ce)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'flozsec', 'fl ozsec', 'жиунсек', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s*(в|\/)?\s*ун(ц(ии|ия|ий|ию)?)?\s*(в|\/)?\s*с(е(к)?)?$/i]
    },
    barrel_oil_sec: {
        r: '6.29/1',
        query: [/^bar(r(el(s)?)?)?\s*(per|\/)?\s*s(e(c(s)?)?)?$/i, 'barssec', 'brlsec', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s*(в|\/)?\s*с(е(к)?)?$/i, 'брсек', 'брлсек']
    },
    cubic_metre_min: {
        r: '1/(1 / (1 / 60))',
        query: ['m3min', 'm3min', 'cubicmetremin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*m(et(r(e(s)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'метркубв мин', 'м3мин', 'м3мин', /^кубометр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*м(и(н)?)?$/i,/^куб(ов|а|ы|е)\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_kilometre_min: {
        r: '0.000000001/(1 / (1 / 60))',
        query: ['km3min', 'km3min', 'cubickilometremin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*k(ilo(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'километркубв мин', 'км3мин', 'км3мин', /^килокубометр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_decimetre_min: {
        r: '1000/(1 / (1 / 60))',
        query: ['dm3min', 'dm3min', 'cubicdecimetremin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*d(eci(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'дециметркубв мин', 'дм3мин', 'дм3мин', /^децикубометр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_centimetre_min: {
        r: '1000000/(1 / (1 / 60))',
        query: ['cm3min', 'cm3min', 'cubiccentimetremin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*c(enti(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'сантиметркубв мин', 'см3мин', 'см3мин', /^сантикубометр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_millimetre_min: {
        r: '1000000000/(1 / (1 / 60))',
        query: ['mm3min', 'mm3min', 'cubicmillimetremin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mil(li(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'миллиметркубв мин', 'мм3мин', 'мм3мин', /^милликубометр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_mile_min: {
        r: '0.0000000002399/(1 / (1 / 60))',
        query: ['mi3min', 'mi3min', 'cubicmilemin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mi(l(e(s)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'милякубв мин', 'миля3мин', 'миля3мин', 'миликубв мин', 'мили3мин', 'мили3мин', 'милькубв мин', 'миль3мин', 'миль3мин', /^ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_yard_min: {
        r: '1.308/(1 / (1 / 60))',
        query: ['yd3min', 'yd3min', 'cubicyardmin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*ya(r(d(s)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'ярдкубв мин', 'ярд3мин', 'ярд3мин', 'ярдакубв мин', 'ярда3мин', 'ярда3мин', 'ярдовкубв мин', 'ярдов3мин', 'ярдов3мин', /^яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_feet_min: {
        r: '35.31/(1 / (1 / 60))',
        query: ['ft3min', 'ft3min', 'cubicfeetmin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*fe(e(t(s)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'футкубв мин', 'фут3мин', 'фут3мин', 'футакубв мин', 'фута3мин', 'фута3мин', 'футовкубв мин', 'футов3мин', 'футов3мин', /^фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    cubic_inch_min: {
        r: '61024/(1 / (1 / 60))',
        query: ['in3min', 'in3min', 'cubicinchmin', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*in(c(h(es)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'дюймкубв мин', 'дюйм3мин', 'дюйм3мин', 'дюймакубв мин', 'дюйма3мин', 'дюйма3мин', 'дюймовкубв мин', 'дюймов3мин', 'дюймов3мин', /^дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    hectolitre_min: {
        r: '10/(1 / (1 / 60))',
        query: [/^(h|hect)(o(l(i(t(r(e(s)?)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'hcltmin', 'hlmin', /^гект(о(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'глмин']
    },
    decalitre_min: {
        r: '100/(1 / (1 / 60))',
        query: [/^(d|deca)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'decaltmin', 'decalmin', /^дек(а(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'декалмин']
    },
    litre_min: {
        r: '1000/(1 / (1 / 60))',
        query: [/^(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'ltmin', 'lmin', /^(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'лмин']
    },
    decilitre_min: {
        r: '10000/(1 / (1 / 60))',
        query: [/^(d|deci)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'dcltmin', 'dlmin', /^деци(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'длмин']
    },
    centilitre_min: {
        r: '100000/(1 / (1 / 60))',
        query: [/^(c|centi)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'cltmin', 'clmin', /^санти(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'слмин']
    },
    millilitre_min: {
        r: '1000000/(1 / (1 / 60))',
        query: [/^(m|milli)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'mltmin', 'mlmin', /^милли(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'млмин']
    },
    microlitre_min: {
        r: '1000000000/(1 / (1 / 60))',
        query: [/^(m|micro)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'mcltmin', 'mclmin', /^микро(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'мклмин']
    },
    gallon_usa_min: {
        r: '264.2/(1 / (1 / 60))',
        query: [/^gal(lon(s)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'galsmin', 'glnmin', 'галмин', /^гал(л(он(ов|а|ы|е)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'глмин']
    },
    pint_usa_min: {
        r: '2113/(1 / (1 / 60))',
        query: [/^pint(s)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'ptsmin', 'ptmin', /^пин(т(а|ы|е)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'птмин']
    },
    fluid_ounce_usa_min: {
        r: '33814/(1 / (1 / 60))',
        query: [/^fl(u(id)?)?\s*(per|\/)?\s*o(un(ce)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'flozmin', 'fl ozmin', 'жиунмин', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s*(в|\/)?\s*ун(ц(ии|ия|ий|ию)?)?\s*(в|\/)?\s*м(и(н)?)?$/i]
    },
    barrel_oil_min: {
        r: '6.29/(1 / (1 / 60))',
        query: [/^bar(r(el(s)?)?)?\s*(per|\/)?\s*m(i(n(s)?)?)?$/i, 'barsmin', 'brlmin', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s*(в|\/)?\s*м(и(н)?)?$/i, 'брмин', 'брлмин']
    },
    cubic_metre_hour: {
        r: '1/(1 / (60 * 60))',
        query: ['m3h', 'm3h', 'cubicmetreh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*m(et(r(e(s)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'метркубв ч', 'м3ч', 'м3ч', /^кубометр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i,/^куб(ов|а|ы|е)\s*(в|\/)?\s*ч(а(с)?)?$/i,/^куб(ов|а|ы|е)$/i]
    },
    cubic_kilometre_hour: {
        r: '0.000000001/(1 / (60 * 60))',
        query: ['km3h', 'km3h', 'cubickilometreh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*k(ilo(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'километркубв ч', 'км3ч', 'км3ч', /^килокубометр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_decimetre_hour: {
        r: '1000/(1 / (60 * 60))',
        query: ['dm3h', 'dm3h', 'cubicdecimetreh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*d(eci(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'дециметркубв ч', 'дм3ч', 'дм3ч', /^децикубометр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_centimetre_hour: {
        r: '1000000/(1 / (60 * 60))',
        query: ['cm3h', 'cm3h', 'cubiccentimetreh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*c(enti(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'сантиметркубв ч', 'см3ч', 'см3ч', /^сантикубометр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_millimetre_hour: {
        r: '1000000000/(1 / (60 * 60))',
        query: ['mm3h', 'mm3h', 'cubicmillimetreh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mil(li(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'миллиметркубв ч', 'мм3ч', 'мм3ч', /^милликубометр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_mile_hour: {
        r: '0.0000000002399/(1 / (60 * 60))',
        query: ['mi3h', 'mi3h', 'cubicmileh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mi(l(e(s)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'милякубв ч', 'миля3ч', 'миля3ч', 'миликубв ч', 'мили3ч', 'мили3ч', 'милькубв ч', 'миль3ч', 'миль3ч', /^ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_yard_hour: {
        r: '1.308/(1 / (60 * 60))',
        query: ['yd3h', 'yd3h', 'cubicyardh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*ya(r(d(s)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'ярдкубв ч', 'ярд3ч', 'ярд3ч', 'ярдакубв ч', 'ярда3ч', 'ярда3ч', 'ярдовкубв ч', 'ярдов3ч', 'ярдов3ч', /^яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_feet_hour: {
        r: '35.31/(1 / (60 * 60))',
        query: ['ft3h', 'ft3h', 'cubicfeeth', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*fe(e(t(s)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'футкубв ч', 'фут3ч', 'фут3ч', 'футакубв ч', 'фута3ч', 'фута3ч', 'футовкубв ч', 'футов3ч', 'футов3ч', /^фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    cubic_inch_hour: {
        r: '61024/(1 / (60 * 60))',
        query: ['in3h', 'in3h', 'cubicinchh', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*in(c(h(es)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'дюймкубв ч', 'дюйм3ч', 'дюйм3ч', 'дюймакубв ч', 'дюйма3ч', 'дюйма3ч', 'дюймовкубв ч', 'дюймов3ч', 'дюймов3ч', /^дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    hectolitre_hour: {
        r: '10/(1 / (60 * 60))',
        query: [/^(h|hect)(o(l(i(t(r(e(s)?)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'hclth', 'hlh', /^гект(о(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'глч']
    },
    decalitre_hour: {
        r: '100/(1 / (60 * 60))',
        query: [/^(d|deca)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'decalth', 'decalh', /^дек(а(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'декалч']
    },
    litre_hour: {
        r: '1000/(1 / (60 * 60))',
        query: [/^(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'lth', 'lh', /^(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'лч']
    },
    decilitre_hour: {
        r: '10000/(1 / (60 * 60))',
        query: [/^(d|deci)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'dclth', 'dlh', /^деци(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'длч']
    },
    centilitre_hour: {
        r: '100000/(1 / (60 * 60))',
        query: [/^(c|centi)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'clth', 'clh', /^санти(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'слч']
    },
    millilitre_hour: {
        r: '1000000/(1 / (60 * 60))',
        query: [/^(m|milli)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'mlth', 'mlh', /^милли(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'млч']
    },
    microlitre_hour: {
        r: '1000000000/(1 / (60 * 60))',
        query: [/^(m|micro)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'mclth', 'mclh', /^микро(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'мклч']
    },
    gallon_usa_hour: {
        r: '264.2/(1 / (60 * 60))',
        query: [/^gal(lon(s)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'galsh', 'glnh', 'галч', /^гал(л(он(ов|а|ы|е)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'глч']
    },
    pint_usa_hour: {
        r: '2113/(1 / (60 * 60))',
        query: [/^pint(s)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'ptsh', 'pth', /^пин(т(а|ы|е)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'птч']
    },
    fluid_ounce_usa_hour: {
        r: '33814/(1 / (60 * 60))',
        query: [/^fl(u(id)?)?\s*(per|\/)?\s*o(un(ce)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'flozh', 'fl ozh', 'жиунч', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s*(в|\/)?\s*ун(ц(ии|ия|ий|ию)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i]
    },
    barrel_oil_hour: {
        r: '6.29/(1 / (60 * 60))',
        query: [/^bar(r(el(s)?)?)?\s*(per|\/)?\s*h(o(u(r(s)?)?)?)?$/i, 'barsh', 'brlh', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s*(в|\/)?\s*ч(а(с)?)?$/i, 'брч', 'брлч']
    },
    cubic_metre_day: {
        r: '1/(1 / (86400))',
        query: ['m3/d', 'm3/d', 'cubicmetre/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*m(et(r(e(s)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'метркубв д', 'м3/д', 'м3/д', /^кубометр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i,/^куб(ов|а|ы|е)\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_kilometre_day: {
        r: '0.000000001/(1 / (86400))',
        query: ['km3/d', 'km3/d', 'cubickilometre/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*k(ilo(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'километркубв д', 'км3/д', 'км3/д', /^килокубометр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_decimetre_day: {
        r: '1000/(1 / (86400))',
        query: ['dm3/d', 'dm3/d', 'cubicdecimetre/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*d(eci(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'дециметркубв ч', 'дм3/д', 'дм3/д', /^децикубометр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_centimetre_day: {
        r: '1000000/(1 / (86400))',
        query: ['cm3/d', 'cm3/d', 'cubiccentimetre/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*c(enti(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'сантиметркубв д', 'см3/д', 'см3/д', /^сантикубометр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_millimetre_day: {
        r: '1000000000/(1 / (86400))',
        query: ['mm3/d', 'mm3/d', 'cubicmillimetre/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mil(li(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'миллиметркубв д', 'мм3/д', 'мм3/д', /^милликубометр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_mile_day: {
        r: '0.0000000002399/(1 / (86400))',
        query: ['mi3/d', 'mi3/d', 'cubicmile/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mi(l(e(s)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'милякубв д', 'миля3/д', 'миля3/д', 'миликубв д', 'мили3/д', 'мили3/д', 'милькубв д', 'миль3/д', 'миль3/д', /^ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_yard_day: {
        r: '1.308/(1 / (86400))',
        query: ['yd3/d', 'yd3/d', 'cubicyard/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*ya(r(d(s)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'ярдкубв д', 'ярд3/д', 'ярд3/д', 'ярдакубв д', 'ярда3/д', 'ярда3/д', 'ярдовкубв д', 'ярдов3/д', 'ярдов3/д', /^яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_feet_day: {
        r: '35.31/(1 / (86400))',
        query: ['ft3/d', 'ft3/d', 'cubicfeet/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*fe(e(t(s)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'футкубв д', 'фут3/д', 'фут3/д', 'футакубв д', 'фута3/д', 'фута3/д', 'футовкубв д', 'футов3/д', 'футов3/д', /^фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    cubic_inch_day: {
        r: '61024/(1 / (86400))',
        query: ['in3/d', 'in3/d', 'cubicinch/d', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*in(c(h(es)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'дюймкубв д', 'дюйм3/д', 'дюйм3/д', 'дюймакубв д', 'дюйма3/д', 'дюйма3/д', 'дюймовкубв д', 'дюймов3/д', 'дюймов3/д', /^дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    hectolitre_day: {
        r: '10/(1 / (86400))',
        query: [/^(h|hect)(o(l(i(t(r(e(s)?)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'hclt/d', 'hl/d', /^гект(о(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'гл/д']
    },
    decalitre_day: {
        r: '100/(1 / (86400))',
        query: [/^(d|deca)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'decalt/d', 'decal/d', /^дек(а(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'декал/д']
    },
    litre_day: {
        r: '1000/(1 / (86400))',
        query: [/^(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'lt/d', 'l/d', /^(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'л/д']
    },
    decilitre_day: {
        r: '10000/(1 / (86400))',
        query: [/^(d|deci)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'dclt/d', 'dl/d', /^деци(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'дл/д']
    },
    centilitre_day: {
        r: '100000/(1 / (86400))',
        query: [/^(c|centi)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'clt/d', 'cl/d', /^санти(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'сл/д']
    },
    millilitre_day: {
        r: '1000000/(1 / (86400))',
        query: [/^(m|milli)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'mlt/d', 'ml/d', /^милли(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'мл/д']
    },
    microlitre_day: {
        r: '1000000000/(1 / (86400))',
        query: [/^(m|micro)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'mclt/d', 'mcl/d', /^микро(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'мкл/д']
    },
    gallon_usa_day: {
        r: '264.2/(1 / (86400))',
        query: [/^gal(lon(s)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'gals/d', 'gln/d', 'гал/д', /^гал(л(он(ов|а|ы|е)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'гл/д']
    },
    pint_usa_day: {
        r: '2113/(1 / (86400))',
        query: [/^pint(s)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'pts/d', 'pt/d', /^пин(т(а|ы|е)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'пт/д']
    },
    fluid_ounce_usa_day: {
        r: '33814/(1 / (86400))',
        query: [/^fl(u(id)?)?\s*(per|\/)?\s*o(un(ce)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'floz/d', 'fl oz/d', 'жиун/д', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s*(в|\/)?\s*ун(ц(ии|ия|ий|ию)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i]
    },
    barrel_oil_day: {
        r: '6.29/(1 / (86400))',
        query: [/^bar(r(el(s)?)?)?\s*(per|\/)?\s*d(a(y(s)?)?)?$/i, 'bars/d', 'brl/d', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s*(в|\/)?\s*д(е(н(ь)?)?)?$/i, 'бр/д', 'брл/д']
    },
    cubic_metre_week: {
        r: '1/(1 / (7 * 24 * 60 * 60))',
        query: ['m3w', 'm3w', 'cubicmetrew', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*m(et(r(e(s)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'метркубв н', 'м3н', 'м3н', /^кубометр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i,/^куб(ов|а|ы|е)\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_kilometre_week: {
        r: '0.000000001/(1 / (7 * 24 * 60 * 60))',
        query: ['km3w', 'km3w', 'cubickilometrew', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*k(ilo(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'километркубв н', 'км3н', 'км3н', /^килокубометр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_decimetre_week: {
        r: '1000/(1 / (7 * 24 * 60 * 60))',
        query: ['dm3w', 'dm3w', 'cubicdecimetrew', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*d(eci(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'дециметркубв н', 'дм3н', 'дм3н', /^децикубометр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_centimetre_week: {
        r: '1000000/(1 / (7 * 24 * 60 * 60))',
        query: ['cm3w', 'cm3w', 'cubiccentimetrew', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*c(enti(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'сантиметркубв н', 'см3н', 'см3н', /^сантикубометр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_millimetre_week: {
        r: '1000000000/(1 / (7 * 24 * 60 * 60))',
        query: ['mm3w', 'mm3w', 'cubicmillimetrew', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mil(li(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'миллиметркубв н', 'мм3н', 'мм3н', /^милликубометр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_mile_week: {
        r: '0.0000000002399/(1 / (7 * 24 * 60 * 60))',
        query: ['mi3w', 'mi3w', 'cubicmilew', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mi(l(e(s)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'милякубв н', 'миля3н', 'миля3н', 'миликубв н', 'мили3н', 'мили3н', 'милькубв н', 'миль3н', 'миль3н', /^ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_yard_week: {
        r: '1.308/(1 / (7 * 24 * 60 * 60))',
        query: ['yd3w', 'yd3w', 'cubicyardw', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*ya(r(d(s)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'ярдкубв н', 'ярд3н', 'ярд3н', 'ярдакубв н', 'ярда3н', 'ярда3н', 'ярдовкубв н', 'ярдов3н', 'ярдов3н', /^яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_feet_week: {
        r: '35.31/(1 / (7 * 24 * 60 * 60))',
        query: ['ft3w', 'ft3w', 'cubicfeetw', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*fe(e(t(s)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'футкубв н', 'фут3н', 'фут3н', 'футакубв н', 'фута3н', 'фута3н', 'футовкубв н', 'футов3н', 'футов3н', /^фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    cubic_inch_week: {
        r: '61024/(1 / (7 * 24 * 60 * 60))',
        query: ['in3w', 'in3w', 'cubicinchw', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*in(c(h(es)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'дюймкубв н', 'дюйм3н', 'дюйм3н', 'дюймакубв н', 'дюйма3н', 'дюйма3н', 'дюймовкубв н', 'дюймов3н', 'дюймов3н', /^дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая|ю)?)?)?\s*(в|\/)?\s*дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    hectolitre_week: {
        r: '10/(1 / (7 * 24 * 60 * 60))',
        query: [/^(h|hect)(o(l(i(t(r(e(s)?)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'hcltw', 'hlw', /^гект(о(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'глн']
    },
    decalitre_week: {
        r: '100/(1 / (7 * 24 * 60 * 60))',
        query: [/^(d|deca)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'decaltw', 'decalw', /^дек(а(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'декалн']
    },
    litre_week: {
        r: '1000/(1 / (7 * 24 * 60 * 60))',
        query: [/^(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'ltw', 'lw', /^(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'лн']
    },
    decilitre_week: {
        r: '10000/(1 / (7 * 24 * 60 * 60))',
        query: [/^(d|deci)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'dcltw', 'dlw', /^деци(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'длн']
    },
    centilitre_week: {
        r: '100000/(1 / (7 * 24 * 60 * 60))',
        query: [/^(c|centi)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'cltw', 'clw', /^санти(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'слн']
    },
    millilitre_week: {
        r: '1000000/(1 / (7 * 24 * 60 * 60))',
        query: [/^(m|milli)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'mltw', 'mlw', /^милли(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'млн']
    },
    microlitre_week: {
        r: '1000000000/(1 / (7 * 24 * 60 * 60))',
        query: [/^(m|micro)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'mcltw', 'mclw', /^микро(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'мклн']
    },
    gallon_usa_week: {
        r: '264.2/(1 / (7 * 24 * 60 * 60))',
        query: [/^gal(lon(s)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'galsw', 'glnw', 'галн', /^гал(л(он(ов|а|ы|е)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'глн']
    },
    pint_usa_week: {
        r: '2113/(1 / (7 * 24 * 60 * 60))',
        query: [/^pint(s)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'ptsw', 'ptw', /^пин(т(а|ы|е)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'птн']
    },
    fluid_ounce_usa_week: {
        r: '33814/(1 / (7 * 24 * 60 * 60))',
        query: [/^fl(u(id)?)?\s*(per|\/)?\s*o(un(ce)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'flozw', 'fl ozw', 'жиунн', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s*(в|\/)?\s*ун(ц(ии|ия|ий|ию)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i]
    },
    barrel_oil_week: {
        r: '6.29/(1 / (7 * 24 * 60 * 60))',
        query: [/^bar(r(el(s)?)?)?\s*(per|\/)?\s*w(e(e(k(s)?)?)?)?$/i, 'barsw', 'brlw', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s*(в|\/)?\s*н(е(д(е(л(ь|я|ю)?)?)?)?)?$/i, 'брн', 'брлн']
    },
    cubic_metre_year: {
        r: '1/(1 / 31536000)',
        query: ['m3y', 'm3y', 'cubicmetrey', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*m(et(r(e(s)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'метркубвг', 'м3г', 'м3г', /^кубометр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*м(етр(ов|а|ы|е)?)?\s*(в|\/)?\s*г(о(д)?)?$/i,/^куб(ов|а|ы|е)\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_kilometre_year: {
        r: '0.000000001/(1 / 31536000)',
        query: ['km3y', 'km3y', 'cubickilometrey', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*k(ilo(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'километркубвг', 'км3г', 'км3г', /^килокубометр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*к(ило(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_decimetre_year: {
        r: '1000/(1 / 31536000)',
        query: ['dm3y', 'dm3y', 'cubicdecimetrey', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*d(eci(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'дециметркубвг', 'дм3г', 'дм3г', /^децикубометр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*д(еци(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_centimetre_year: {
        r: '1000000/(1 / 31536000)',
        query: ['cm3y', 'cm3y', 'cubiccentimetrey', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*c(enti(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'сантиметркубвг', 'см3г', 'см3г', /^сантикубометр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*с(анти(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_millimetre_year: {
        r: '1000000000/(1 / 31536000)',
        query: ['mm3y', 'mm3y', 'cubicmillimetrey', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mil(li(met(r(e(s)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'миллиметркубвг', 'мм3г', 'мм3г', /^милликубометр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s*(в|\/)?\s*мил(ли(метр(ов|а|ы|е)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_mile_year: {
        r: '0.0000000002399/(1 / 31536000)',
        query: ['mi3y', 'mi3y', 'cubicmiley', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*mi(l(e(s)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'милякубвг', 'миля3г', 'миля3г', 'миликубвг', 'мили3г', 'мили3г', 'милькубвг', 'миль3г', 'миль3г', /^ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*ми(л(ь|я|и|ю)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_yard_year: {
        r: '1.308/(1 / 31536000)',
        query: ['yd3y', 'yd3y', 'cubicyardy', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*ya(r(d(s)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'ярдкубвг', 'ярд3г', 'ярд3г', 'ярдакубвг', 'ярда3г', 'ярда3г', 'ярдовкубвг', 'ярдов3г', 'ярдов3г', /^яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*яр(д(ов|а|ы|е)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_feet_year: {
        r: '35.31/(1 / 31536000)',
        query: ['ft3y', 'ft3y', 'cubicfeety', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*fe(e(t(s)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'футкубвг', 'фут3г', 'фут3г', 'футакубвг', 'фута3г', 'фута3г', 'футовкубвг', 'футов3г', 'футов3г', /^фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*фу(т(ов|а|ы|е)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    cubic_inch_year: {
        r: '61024/(1 / 31536000)',
        query: ['in3y', 'in3y', 'cubicinchy', /^c(u(b(ic)?)?)?\s*(per|\/)?\s*in(c(h(es)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'дюймкубвг', 'дюйм3г', 'дюйм3г', 'дюймакубвг', 'дюйма3г', 'дюйма3г', 'дюймовкубвг', 'дюймов3г', 'дюймов3г', /^дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s*(в|\/)?\s*дю(йм(ов|а|ы|е)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    hectolitre_year: {
        r: '10/(1 / 31536000)',
        query: [/^(h|hect)(o(l(i(t(r(e(s)?)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'hclty', 'hly', /^гект(о(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'глг']
    },
    decalitre_year: {
        r: '100/(1 / 31536000)',
        query: [/^(d|deca)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'decalty', 'decaly', /^дек(а(л(и(т(р(ов|а|ы|е)?)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'декалг']
    },
    litre_year: {
        r: '1000/(1 / 31536000)',
        query: [/^(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'lty', 'ly', /^(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'лг']
    },
    decilitre_year: {
        r: '10000/(1 / 31536000)',
        query: [/^(d|deci)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'dclty', 'dly', /^деци(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'длг']
    },
    centilitre_year: {
        r: '100000/(1 / 31536000)',
        query: [/^(c|centi)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'clty', 'cly', /^санти(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'слг']
    },
    millilitre_year: {
        r: '1000000/(1 / 31536000)',
        query: [/^(m|milli)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'mlty', 'mly', /^милли(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'млг']
    },
    microlitre_year: {
        r: '1000000000/(1 / 31536000)',
        query: [/^(m|micro)(l(i(t(r(e(s)?)?)?)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'mclty', 'mcly', /^микро(л(и(т(р(ов|а|ы|е)?)?)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'мклг']
    },
    gallon_usa_year: {
        r: '264.2/(1 / 31536000)',
        query: [/^gal(lon(s)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'galsy', 'glny', 'галг', /^гал(л(он(ов|а|ы|е)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'глг']
    },
    pint_usa_year: {
        r: '2113/(1 / 31536000)',
        query: [/^pint(s)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'ptsy', 'pty', /^пин(т(а|ы|е)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'птг']
    },
    fluid_ounce_usa_year: {
        r: '33814/(1 / 31536000)',
        query: [/^fl(u(id)?)?\s*(per|\/)?\s*o(un(ce)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'flozy', 'fl ozy', 'жиунг', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s*(в|\/)?\s*ун(ц(ии|ия|ий|ию)?)?\s*(в|\/)?\s*г(о(д)?)?$/i]
    },
    barrel_oil_year: {
        r: '6.29/(1 / 31536000)',
        query: [/^bar(r(el(s)?)?)?\s*(per|\/)?\s*y(e(a(r(s)?)?)?)?$/i, 'barsy', 'brly', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s*(в|\/)?\s*г(о(д)?)?$/i, 'брг', 'брлг']
    }
}

module.exports = data;
