const data = {
    cubic_metre: {
        r: 1,
        query: ['m^3','cubic metre',/^cub(ic)? met(r(e(s)?)?)?$/i,'метр/куб','м^3','кубометр',/^метр(ов|а|ы|е)? куб(ич(еск(их|ого|ий|ом)?)?)?$/i,/^куб(ич(еск(их|ого|ий|ом)?)?)? метр(ов|а|ы|е)?$/i]
    },
    cubic_kilometre: {
        r: 0.000000001,
        query: ['km^3','cubic kilometre',/^cub(ic)? kilo(met(r(e(s)?)?)?)?$/i,'километр/куб','км^3','килокубометр',/^кило(метр(ов|а|ы|е)?)? куб(ич(еск(их|ого|ий|ом)?)?)?$/i,/^куб(ич(еск(их|ого|ий|ом)?)?)? кило(метр(ов|а|ы|е)?)?$/i]
    },
    cubic_decimetre: {
        r: 1000,
        query: ['dm^3','cubic decimetre',/^cub(ic)? deci(met(r(e(s)?)?)?)?$/i,'дециметр/куб','дм^3','децикубометр',/^деци(метр(ов|а|ы|е)?)? куб(ич(еск(их|ого|ий|ом)?)?)?$/i,/^куб(ич(еск(их|ого|ий|ом)?)?)? деци(метр(ов|а|ы|е)?)?$/i]
    },
    cubic_centimetre: {
        r: 1 000 000,
        query: ['cm^3','cubic centimetre',/^cub(ic)? centi(met(r(e(s)?)?)?)?$/i,'сантиметр/куб','см^3','сантикубометр',/^санти(метр(ов|а|ы|е)?)? куб(ич(еск(их|ого|ий|ом)?)?)?$/i,/^куб(ич(еск(их|ого|ий|ом)?)?)? санти(метр(ов|а|ы|е)?)?$/i]
    },
    cubic_millimetre: {
        r: 1 000 000 000,
        query: ['mm^3','cubic millimetre',/^cub(ic)? milli(met(r(e(s)?)?)?)?$/i,'миллиметр/куб','мм^3','милликубометр',/^милли(метр(ов|а|ы|е)?)? куб(ич(еск(их|ого|ий|ом)?)?)?$/i,/^куб(ич(еск(их|ого|ий|ом)?)?)? милли(метр(ов|а|ы|е)?)?$/i]
    },
    hectolitre: {
        r: 10,
        query: [/^hect(o(litre(s)?)?)?$/i,'hclt','hl',/^гект(о(литр(ов|а|ы|е)?)?)?$/i,'гл']
    },
    decalitre: {
        r: 100,
        query: [/^deca(litre(s)?)?$/i,'decalt','decal',/^дек(а(литр(ов|а|ы|е)?)?)?$/i,'декал']
    },
    litre: {
        r: 1 000,
        query: [/^(litre(s)?)?$/i,'lt','l',/^(литр(ов|а|ы|е)?)?$/i,'л']
    },
    decilitre: {
        r: 10 000,
        query: [/^deci(litre(s)?)?$/i,'dclt','dl',/^деци(литр(ов|а|ы|е)?)?$/i,'дл']
    },
    centilitre: {
        r: 100 000,
        query: [/^centi(litre(s)?)?$/i,'clt','cl',/^санти(литр(ов|а|ы|е)?)?$/i,'сл']
    },
    millilitre: {
        r: 1 000 000,
        query: [/^milli(litre(s)?)?$/i,'mlt','ml',/^милли(литр(ов|а|ы|е)?)?$/i,'мл']
    },
    microlitre: {
        r: 1 000 000 000,
        query: [/^micro(litre(s)?)?$/i,'mclt','mcl',/^микро(литр(ов|а|ы|е)?)?$/i,'мкл']
    },
    gallon_usa: {
        r: 264.2,
        query: [/^gal(lon(s)?)?$/i,'gals','gln','гал',/^гал(л(он(ов|а|ы|е)?)?)?$/i,'гл']
    },
    pint_usa: {
        r: 2 113,
        query: [/^pint(s)?$/i,'pts','pt',/^пин(т|а|ы|е)?$/i,'пт']
    },
    fluid_ounce_usa: {
        r: 33 814,
        query: [/^fl(u(id)?)? o(un(ce)?)?$/i,'floz','fl oz','жиун',/^ж(ид(к(ая|их|ую|ой|)?)?)? ун(ц(ии|ия|ий|ию)?)?$/i]
    },
    barrel_oil: {
        r: 6.29,
        query: [/^bar(r(el(s)?)?)?$/i,'bars','brl',/^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?$/i,'бр','брл']
    }
}

module.exports = data;