const data = {
    cubic_metre_sec: {
        r: '1/1',
        query: ['m3/sec', 'm^3/sec', 'cubic metre/sec', /^cub(ic)?\s?m(et(r(e(s)?)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'метр/куб в сек', 'м3/сек', 'м^3/сек', /^кубометр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(етр(ов|а|ы|е)?)?\s?с(е(к)?)?$/i,/^куб(ов|а|ы|е)\s?с(е(к)?)?$/i]
    },
    cubic_kilometre_sec: {
        r: '0.000000001/1',
        query: ['km3/sec', 'km^3/sec', 'cubic kilometre/sec', /^cub(ic)?\s?k(ilo(met(r(e(s)?)?)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'километр/куб в сек', 'км3/сек', 'км^3/сек', /^килокубометр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?к(ило(метр(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i]
    },
    cubic_decimetre_sec: {
        r: '1000/1',
        query: ['dm3/sec', 'dm^3/sec', 'cubic decimetre/sec', /^cub(ic)?\s?d(eci(met(r(e(s)?)?)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'дециметр/куб в сек', 'дм3/сек', 'дм^3/сек', /^децикубометр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(еци(метр(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i]
    },
    cubic_centimetre_sec: {
        r: '1000000/1',
        query: ['cm3/sec', 'cm^3/sec', 'cubic centimetre/sec', /^cub(ic)?\s?c(enti(met(r(e(s)?)?)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'сантиметр/куб в сек', 'см3/сек', 'см^3/сек', /^сантикубометр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(анти(метр(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i]
    },
    cubic_millimetre_sec: {
        r: '1000000000/1',
        query: ['mm3/sec', 'mm^3/sec', 'cubic millimetre/sec', /^cub(ic)?\s?mil(li(met(r(e(s)?)?)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'миллиметр/куб в сек', 'мм3/сек', 'мм^3/сек', /^милликубометр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s?с(е(к)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?мил(ли(метр(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i]
    },
    cubic_mile_sec: {
        r: '0.0000000002399/1',
        query: ['mi3/sec', 'mi^3/sec', 'cubic mile/sec', /^cub(ic)?\s?mi(l(e(s)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'миля/куб в сек', 'миля3/сек', 'миля^3/сек', 'мили/куб в сек', 'мили3/сек', 'мили^3/сек', 'миль/куб в сек', 'миль3/сек', 'миль^3/сек', /^ми(л(ь|я|и|ю)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ми(л(ь|я|и|ю)?)?\s?с(е(к)?)?$/i]
    },
    cubic_yard_sec: {
        r: '1.308/1',
        query: ['yd3/sec', 'yd^3/sec', 'cubic yard/sec', /^cub(ic)?\s?ya(r(d(s)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'ярд/куб в сек', 'ярд3/сек', 'ярд^3/сек', 'ярда/куб в сек', 'ярда3/сек', 'ярда^3/сек', 'ярдов/куб в сек', 'ярдов3/сек', 'ярдов^3/сек', /^яр(д(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?яр(д(ов|а|ы|е)?)?\s?с(е(к)?)?$/i]
    },
    cubic_feet_sec: {
        r: '35.31/1',
        query: ['ft3/sec', 'ft^3/sec', 'cubic feet/sec', /^cub(ic)?\s?fe(e(t(s)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'фут/куб в сек', 'фут3/сек', 'фут^3/сек', 'фута/куб в сек', 'фута3/сек', 'фута^3/сек', 'футов/куб в сек', 'футов3/сек', 'футов^3/сек', /^фу(т(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?фу(т(ов|а|ы|е)?)?\s?с(е(к)?)?$/i]
    },
    cubic_inch_sec: {
        r: '61024/1',
        query: ['in3/sec', 'in^3/sec', 'cubic inch/sec', /^cub(ic)?\s?in(c(h(es)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'дюйм/куб в сек', 'дюйм3/сек', 'дюйм^3/сек', 'дюйма/куб в сек', 'дюйма3/сек', 'дюйма^3/сек', 'дюймов/куб в сек', 'дюймов3/сек', 'дюймов^3/сек', /^дю(йм(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?с(е(к)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?дю(йм(ов|а|ы|е)?)?\s?с(е(к)?)?$/i]
    },
    hectolitre_sec: {
        r: '10/1',
        query: [/^hect(o(litre(s)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'hclt/sec', 'hl/sec', /^гект(о(литр(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i, 'гл/сек']
    },
    decalitre_sec: {
        r: '100/1',
        query: [/^deca(litre(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'decalt/sec', 'decal/sec', /^дек(а(литр(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i, 'декал/сек']
    },
    litre_sec: {
        r: '1000/1',
        query: [/^(litre(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'lt/sec', 'l/sec', /^(литр(ов|а|ы|е)?)?\s?с(е(к)?)?$/i, 'л/сек']
    },
    decilitre_sec: {
        r: '10000/1',
        query: [/^deci(litre(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'dclt/sec', 'dl/sec', /^деци(литр(ов|а|ы|е)?)?\s?с(е(к)?)?$/i, 'дл/сек']
    },
    centilitre_sec: {
        r: '100000/1',
        query: [/^centi(litre(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'clt/sec', 'cl/sec', /^санти(литр(ов|а|ы|е)?)?\s?с(е(к)?)?$/i, 'сл/сек']
    },
    millilitre_sec: {
        r: '1000000/1',
        query: [/^milli(litre(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'mlt/sec', 'ml/sec', /^милли(литр(ов|а|ы|е)?)?\s?с(е(к)?)?$/i, 'мл/сек']
    },
    microlitre_sec: {
        r: '1000000000/1',
        query: [/^micro(litre(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'mclt/sec', 'mcl/sec', /^микро(литр(ов|а|ы|е)?)?\s?с(е(к)?)?$/i, 'мкл/сек']
    },
    gallon_usa_sec: {
        r: '264.2/1',
        query: [/^gal(lon(s)?)?\s?(s(e(c(s)?)?)?)?$/i, 'gals/sec', 'gln/sec', 'гал/сек', /^гал(л(он(ов|а|ы|е)?)?)?\s?с(е(к)?)?$/i, 'гл/сек']
    },
    pint_usa_sec: {
        r: '2113/1',
        query: [/^pint(s)?\s?(s(e(c(s)?)?)?)?$/i, 'pts/sec', 'pt/sec', /^пин(т(а|ы|е)?)?\s?с(е(к)?)?$/i, 'пт/сек']
    },
    fluid_ounce_usa_sec: {
        r: '33814/1',
        query: [/^fl(u(id)?)?\s?o(un(ce)?)?\s?(s(e(c(s)?)?)?)?$/i, 'floz/sec', 'fl oz/sec', 'жиун/сек', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s?ун(ц(ии|ия|ий|ию)?)?\s?с(е(к)?)?$/i]
    },
    barrel_oil_sec: {
        r: '6.29/1',
        query: [/^bar(r(el(s)?)?)?\s?(s(e(c(s)?)?)?)?$/i, 'bars/sec', 'brl/sec', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s?с(е(к)?)?$/i, 'бр/сек', 'брл/сек']
    },
    cubic_metre_min: {
        r: '1/60',
        query: ['m3/min', 'm^3/min', 'cubic metre/min', /^cub(ic)?\s?m(et(r(e(s)?)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'метр/куб в мин', 'м3/мин', 'м^3/мин', /^кубометр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(етр(ов|а|ы|е)?)?\s?м(и(н)?)?$/i,/^куб(ов|а|ы|е)\s?м(и(н)?)?$/i]
    },
    cubic_kilometre_min: {
        r: '0.000000001/60',
        query: ['km3/min', 'km^3/min', 'cubic kilometre/min', /^cub(ic)?\s?k(ilo(met(r(e(s)?)?)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'километр/куб в мин', 'км3/мин', 'км^3/мин', /^килокубометр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?к(ило(метр(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i]
    },
    cubic_decimetre_min: {
        r: '1000/60',
        query: ['dm3/min', 'dm^3/min', 'cubic decimetre/min', /^cub(ic)?\s?d(eci(met(r(e(s)?)?)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'дециметр/куб в мин', 'дм3/мин', 'дм^3/мин', /^децикубометр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(еци(метр(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i]
    },
    cubic_centimetre_min: {
        r: '1000000/60',
        query: ['cm3/min', 'cm^3/min', 'cubic centimetre/min', /^cub(ic)?\s?c(enti(met(r(e(s)?)?)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'сантиметр/куб в мин', 'см3/мин', 'см^3/мин', /^сантикубометр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(анти(метр(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i]
    },
    cubic_millimetre_min: {
        r: '1000000000/60',
        query: ['mm3/min', 'mm^3/min', 'cubic millimetre/min', /^cub(ic)?\s?mil(li(met(r(e(s)?)?)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'миллиметр/куб в мин', 'мм3/мин', 'мм^3/мин', /^милликубометр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s?м(и(н)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?мил(ли(метр(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i]
    },
    cubic_mile_min: {
        r: '0.0000000002399/60',
        query: ['mi3/min', 'mi^3/min', 'cubic mile/min', /^cub(ic)?\s?mi(l(e(s)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'миля/куб в мин', 'миля3/мин', 'миля^3/мин', 'мили/куб в мин', 'мили3/мин', 'мили^3/мин', 'миль/куб в мин', 'миль3/мин', 'миль^3/мин', /^ми(л(ь|я|и|ю)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ми(л(ь|я|и|ю)?)?\s?м(и(н)?)?$/i]
    },
    cubic_yard_min: {
        r: '1.308/60',
        query: ['yd3/min', 'yd^3/min', 'cubic yard/min', /^cub(ic)?\s?ya(r(d(s)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'ярд/куб в мин', 'ярд3/мин', 'ярд^3/мин', 'ярда/куб в мин', 'ярда3/мин', 'ярда^3/мин', 'ярдов/куб в мин', 'ярдов3/мин', 'ярдов^3/мин', /^яр(д(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?яр(д(ов|а|ы|е)?)?\s?м(и(н)?)?$/i]
    },
    cubic_feet_min: {
        r: '35.31/60',
        query: ['ft3/min', 'ft^3/min', 'cubic feet/min', /^cub(ic)?\s?fe(e(t(s)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'фут/куб в мин', 'фут3/мин', 'фут^3/мин', 'фута/куб в мин', 'фута3/мин', 'фута^3/мин', 'футов/куб в мин', 'футов3/мин', 'футов^3/мин', /^фу(т(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?фу(т(ов|а|ы|е)?)?\s?м(и(н)?)?$/i]
    },
    cubic_inch_min: {
        r: '61024/60',
        query: ['in3/min', 'in^3/min', 'cubic inch/min', /^cub(ic)?\s?in(c(h(es)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'дюйм/куб в мин', 'дюйм3/мин', 'дюйм^3/мин', 'дюйма/куб в мин', 'дюйма3/мин', 'дюйма^3/мин', 'дюймов/куб в мин', 'дюймов3/мин', 'дюймов^3/мин', /^дю(йм(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?м(и(н)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?дю(йм(ов|а|ы|е)?)?\s?м(и(н)?)?$/i]
    },
    hectolitre_min: {
        r: '10/60',
        query: [/^hect(o(litre(s)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'hclt/min', 'hl/min', /^гект(о(литр(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i, 'гл/мин']
    },
    decalitre_min: {
        r: '100/60',
        query: [/^deca(litre(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'decalt/min', 'decal/min', /^дек(а(литр(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i, 'декал/мин']
    },
    litre_min: {
        r: '1000/60',
        query: [/^(litre(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'lt/min', 'l/min', /^(литр(ов|а|ы|е)?)?\s?м(и(н)?)?$/i, 'л/мин']
    },
    decilitre_min: {
        r: '10000/60',
        query: [/^deci(litre(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'dclt/min', 'dl/min', /^деци(литр(ов|а|ы|е)?)?\s?м(и(н)?)?$/i, 'дл/мин']
    },
    centilitre_min: {
        r: '100000/60',
        query: [/^centi(litre(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'clt/min', 'cl/min', /^санти(литр(ов|а|ы|е)?)?\s?м(и(н)?)?$/i, 'сл/мин']
    },
    millilitre_min: {
        r: '1000000/60',
        query: [/^milli(litre(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'mlt/min', 'ml/min', /^милли(литр(ов|а|ы|е)?)?\s?м(и(н)?)?$/i, 'мл/мин']
    },
    microlitre_min: {
        r: '1000000000/60',
        query: [/^micro(litre(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'mclt/min', 'mcl/min', /^микро(литр(ов|а|ы|е)?)?\s?м(и(н)?)?$/i, 'мкл/мин']
    },
    gallon_usa_min: {
        r: '264.2/60',
        query: [/^gal(lon(s)?)?\s?(m(i(n(s)?)?)?)?$/i, 'gals/min', 'gln/min', 'гал/мин', /^гал(л(он(ов|а|ы|е)?)?)?\s?м(и(н)?)?$/i, 'гл/мин']
    },
    pint_usa_min: {
        r: '2113/60',
        query: [/^pint(s)?\s?(m(i(n(s)?)?)?)?$/i, 'pts/min', 'pt/min', /^пин(т(а|ы|е)?)?\s?м(и(н)?)?$/i, 'пт/мин']
    },
    fluid_ounce_usa_min: {
        r: '33814/60',
        query: [/^fl(u(id)?)?\s?o(un(ce)?)?\s?(m(i(n(s)?)?)?)?$/i, 'floz/min', 'fl oz/min', 'жиун/мин', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s?ун(ц(ии|ия|ий|ию)?)?\s?м(и(н)?)?$/i]
    },
    barrel_oil_min: {
        r: '6.29/60',
        query: [/^bar(r(el(s)?)?)?\s?(m(i(n(s)?)?)?)?$/i, 'bars/min', 'brl/min', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s?м(и(н)?)?$/i, 'бр/мин', 'брл/мин']
    },
    cubic_metre_hour: {
        r: '1/3600',
        query: ['m3/h', 'm^3/h', 'cubic metre/h', /^cub(ic)?\s?m(et(r(e(s)?)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'метр/куб в ч', 'м3/ч', 'м^3/ч', /^кубометр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(етр(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i,/^куб(ов|а|ы|е)\s?ч(а(с)?)?$/i,/^куб(ов|а|ы|е)$/i]
    },
    cubic_kilometre_hour: {
        r: '0.000000001/3600',
        query: ['km3/h', 'km^3/h', 'cubic kilometre/h', /^cub(ic)?\s?k(ilo(met(r(e(s)?)?)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'километр/куб в ч', 'км3/ч', 'км^3/ч', /^килокубометр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?к(ило(метр(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_decimetre_hour: {
        r: '1000/3600',
        query: ['dm3/h', 'dm^3/h', 'cubic decimetre/h', /^cub(ic)?\s?d(eci(met(r(e(s)?)?)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'дециметр/куб в ч', 'дм3/ч', 'дм^3/ч', /^децикубометр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(еци(метр(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_centimetre_hour: {
        r: '1000000/3600',
        query: ['cm3/h', 'cm^3/h', 'cubic centimetre/h', /^cub(ic)?\s?c(enti(met(r(e(s)?)?)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'сантиметр/куб в ч', 'см3/ч', 'см^3/ч', /^сантикубометр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(анти(метр(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_millimetre_hour: {
        r: '1000000000/3600',
        query: ['mm3/h', 'mm^3/h', 'cubic millimetre/h', /^cub(ic)?\s?mil(li(met(r(e(s)?)?)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'миллиметр/куб в ч', 'мм3/ч', 'мм^3/ч', /^милликубометр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s?ч(а(с)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?мил(ли(метр(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_mile_hour: {
        r: '0.0000000002399/3600',
        query: ['mi3/h', 'mi^3/h', 'cubic mile/h', /^cub(ic)?\s?mi(l(e(s)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'миля/куб в ч', 'миля3/ч', 'миля^3/ч', 'мили/куб в ч', 'мили3/ч', 'мили^3/ч', 'миль/куб в ч', 'миль3/ч', 'миль^3/ч', /^ми(л(ь|я|и|ю)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ми(л(ь|я|и|ю)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_yard_hour: {
        r: '1.308/3600',
        query: ['yd3/h', 'yd^3/h', 'cubic yard/h', /^cub(ic)?\s?ya(r(d(s)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'ярд/куб в ч', 'ярд3/ч', 'ярд^3/ч', 'ярда/куб в ч', 'ярда3/ч', 'ярда^3/ч', 'ярдов/куб в ч', 'ярдов3/ч', 'ярдов^3/ч', /^яр(д(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?яр(д(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_feet_hour: {
        r: '35.31/3600',
        query: ['ft3/h', 'ft^3/h', 'cubic feet/h', /^cub(ic)?\s?fe(e(t(s)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'фут/куб в ч', 'фут3/ч', 'фут^3/ч', 'фута/куб в ч', 'фута3/ч', 'фута^3/ч', 'футов/куб в ч', 'футов3/ч', 'футов^3/ч', /^фу(т(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?фу(т(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i]
    },
    cubic_inch_hour: {
        r: '61024/3600',
        query: ['in3/h', 'in^3/h', 'cubic inch/h', /^cub(ic)?\s?in(c(h(es)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'дюйм/куб в ч', 'дюйм3/ч', 'дюйм^3/ч', 'дюйма/куб в ч', 'дюйма3/ч', 'дюйма^3/ч', 'дюймов/куб в ч', 'дюймов3/ч', 'дюймов^3/ч', /^дю(йм(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ч(а(с)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?дю(йм(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i]
    },
    hectolitre_hour: {
        r: '10/3600',
        query: [/^hect(o(litre(s)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'hclt/h', 'hl/h', /^гект(о(литр(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i, 'гл/ч']
    },
    decalitre_hour: {
        r: '100/3600',
        query: [/^deca(litre(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'decalt/h', 'decal/h', /^дек(а(литр(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i, 'декал/ч']
    },
    litre_hour: {
        r: '1000/3600',
        query: [/^(litre(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'lt/h', 'l/h', /^(литр(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i, 'л/ч']
    },
    decilitre_hour: {
        r: '10000/3600',
        query: [/^deci(litre(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'dclt/h', 'dl/h', /^деци(литр(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i, 'дл/ч']
    },
    centilitre_hour: {
        r: '100000/3600',
        query: [/^centi(litre(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'clt/h', 'cl/h', /^санти(литр(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i, 'сл/ч']
    },
    millilitre_hour: {
        r: '1000000/3600',
        query: [/^milli(litre(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'mlt/h', 'ml/h', /^милли(литр(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i, 'мл/ч']
    },
    microlitre_hour: {
        r: '1000000000/3600',
        query: [/^micro(litre(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'mclt/h', 'mcl/h', /^микро(литр(ов|а|ы|е)?)?\s?ч(а(с)?)?$/i, 'мкл/ч']
    },
    gallon_usa_hour: {
        r: '264.2/3600',
        query: [/^gal(lon(s)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'gals/h', 'gln/h', 'гал/ч', /^гал(л(он(ов|а|ы|е)?)?)?\s?ч(а(с)?)?$/i, 'гл/ч']
    },
    pint_usa_hour: {
        r: '2113/3600',
        query: [/^pint(s)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'pts/h', 'pt/h', /^пин(т(а|ы|е)?)?\s?ч(а(с)?)?$/i, 'пт/ч']
    },
    fluid_ounce_usa_hour: {
        r: '33814/3600',
        query: [/^fl(u(id)?)?\s?o(un(ce)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'floz/h', 'fl oz/h', 'жиун/ч', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s?ун(ц(ии|ия|ий|ию)?)?\s?ч(а(с)?)?$/i]
    },
    barrel_oil_hour: {
        r: '6.29/3600',
        query: [/^bar(r(el(s)?)?)?\s?(h(o(u(r(s)?)?)?)?)?$/i, 'bars/h', 'brl/h', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s?ч(а(с)?)?$/i, 'бр/ч', 'брл/ч']
    },
    cubic_metre_day: {
        r: '1/86400',
        query: ['m3/d', 'm^3/d', 'cubic metre/d', /^cub(ic)?\s?m(et(r(e(s)?)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'метр/куб в д', 'м3/д', 'м^3/д', /^кубометр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(етр(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i,/^куб(ов|а|ы|е)\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_kilometre_day: {
        r: '0.000000001/86400',
        query: ['km3/d', 'km^3/d', 'cubic kilometre/d', /^cub(ic)?\s?k(ilo(met(r(e(s)?)?)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'километр/куб в д', 'км3/д', 'км^3/д', /^килокубометр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?к(ило(метр(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_decimetre_day: {
        r: '1000/86400',
        query: ['dm3/d', 'dm^3/d', 'cubic decimetre/d', /^cub(ic)?\s?d(eci(met(r(e(s)?)?)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'дециметр/куб в ч', 'дм3/д', 'дм^3/д', /^децикубометр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(еци(метр(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_centimetre_day: {
        r: '1000000/86400',
        query: ['cm3/d', 'cm^3/d', 'cubic centimetre/d', /^cub(ic)?\s?c(enti(met(r(e(s)?)?)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'сантиметр/куб в д', 'см3/д', 'см^3/д', /^сантикубометр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(анти(метр(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_millimetre_day: {
        r: '1000000000/86400',
        query: ['mm3/d', 'mm^3/d', 'cubic millimetre/d', /^cub(ic)?\s?mil(li(met(r(e(s)?)?)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'миллиметр/куб в д', 'мм3/д', 'мм^3/д', /^милликубометр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s?д(е(н(ь)?)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?мил(ли(метр(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_mile_day: {
        r: '0.0000000002399/86400',
        query: ['mi3/d', 'mi^3/d', 'cubic mile/d', /^cub(ic)?\s?mi(l(e(s)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'миля/куб в д', 'миля3/д', 'миля^3/д', 'мили/куб в д', 'мили3/д', 'мили^3/д', 'миль/куб в д', 'миль3/д', 'миль^3/д', /^ми(л(ь|я|и|ю)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ми(л(ь|я|и|ю)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_yard_day: {
        r: '1.308/86400',
        query: ['yd3/d', 'yd^3/d', 'cubic yard/d', /^cub(ic)?\s?ya(r(d(s)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'ярд/куб в д', 'ярд3/д', 'ярд^3/д', 'ярда/куб в д', 'ярда3/д', 'ярда^3/д', 'ярдов/куб в д', 'ярдов3/д', 'ярдов^3/д', /^яр(д(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?яр(д(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_feet_day: {
        r: '35.31/86400',
        query: ['ft3/d', 'ft^3/d', 'cubic feet/d', /^cub(ic)?\s?fe(e(t(s)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'фут/куб в д', 'фут3/д', 'фут^3/д', 'фута/куб в д', 'фута3/д', 'фута^3/д', 'футов/куб в д', 'футов3/д', 'футов^3/д', /^фу(т(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?фу(т(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    cubic_inch_day: {
        r: '61024/86400',
        query: ['in3/d', 'in^3/d', 'cubic inch/d', /^cub(ic)?\s?in(c(h(es)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'дюйм/куб в д', 'дюйм3/д', 'дюйм^3/д', 'дюйма/куб в д', 'дюйма3/д', 'дюйма^3/д', 'дюймов/куб в д', 'дюймов3/д', 'дюймов^3/д', /^дю(йм(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?д(е(н(ь)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?дю(йм(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    hectolitre_day: {
        r: '10/86400',
        query: [/^hect(o(litre(s)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'hclt/d', 'hl/d', /^гект(о(литр(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i, 'гл/д']
    },
    decalitre_day: {
        r: '100/86400',
        query: [/^deca(litre(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'decalt/d', 'decal/d', /^дек(а(литр(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i, 'декал/д']
    },
    litre_day: {
        r: '1000/86400',
        query: [/^(litre(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'lt/d', 'l/d', /^(литр(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i, 'л/д']
    },
    decilitre_day: {
        r: '10000/86400',
        query: [/^deci(litre(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'dclt/d', 'dl/d', /^деци(литр(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i, 'дл/д']
    },
    centilitre_day: {
        r: '100000/86400',
        query: [/^centi(litre(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'clt/d', 'cl/d', /^санти(литр(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i, 'сл/д']
    },
    millilitre_day: {
        r: '1000000/86400',
        query: [/^milli(litre(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'mlt/d', 'ml/d', /^милли(литр(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i, 'мл/д']
    },
    microlitre_day: {
        r: '1000000000/86400',
        query: [/^micro(litre(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'mclt/d', 'mcl/d', /^микро(литр(ов|а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i, 'мкл/д']
    },
    gallon_usa_day: {
        r: '264.2/86400',
        query: [/^gal(lon(s)?)?\s?(d(a(y(s)?)?)?)?$/i, 'gals/d', 'gln/d', 'гал/д', /^гал(л(он(ов|а|ы|е)?)?)?\s?д(е(н(ь)?)?)?$/i, 'гл/д']
    },
    pint_usa_day: {
        r: '2113/86400',
        query: [/^pint(s)?\s?(d(a(y(s)?)?)?)?$/i, 'pts/d', 'pt/d', /^пин(т(а|ы|е)?)?\s?д(е(н(ь)?)?)?$/i, 'пт/д']
    },
    fluid_ounce_usa_day: {
        r: '33814/86400',
        query: [/^fl(u(id)?)?\s?o(un(ce)?)?\s?(d(a(y(s)?)?)?)?$/i, 'floz/d', 'fl oz/d', 'жиун/д', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s?ун(ц(ии|ия|ий|ию)?)?\s?д(е(н(ь)?)?)?$/i]
    },
    barrel_oil_day: {
        r: '6.29/86400',
        query: [/^bar(r(el(s)?)?)?\s?(d(a(y(s)?)?)?)?$/i, 'bars/d', 'brl/d', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s?д(е(н(ь)?)?)?$/i, 'бр/д', 'брл/д']
    },
    cubic_metre_week: {
        r: '1/604800',
        query: ['m3/w', 'm^3/w', 'cubic metre/w', /^cub(ic)?\s?m(et(r(e(s)?)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'метр/куб в н', 'м3/н', 'м^3/н', /^кубометр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(етр(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i,/^куб(ов|а|ы|е)\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_kilometre_week: {
        r: '0.000000001/604800',
        query: ['km3/w', 'km^3/w', 'cubic kilometre/w', /^cub(ic)?\s?k(ilo(met(r(e(s)?)?)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'километр/куб в н', 'км3/н', 'км^3/н', /^килокубометр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?к(ило(метр(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_decimetre_week: {
        r: '1000/604800',
        query: ['dm3/w', 'dm^3/w', 'cubic decimetre/w', /^cub(ic)?\s?d(eci(met(r(e(s)?)?)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'дециметр/куб в н', 'дм3/н', 'дм^3/н', /^децикубометр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(еци(метр(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_centimetre_week: {
        r: '1000000/604800',
        query: ['cm3/w', 'cm^3/w', 'cubic centimetre/w', /^cub(ic)?\s?c(enti(met(r(e(s)?)?)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'сантиметр/куб в н', 'см3/н', 'см^3/н', /^сантикубометр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(анти(метр(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_millimetre_week: {
        r: '1000000000/604800',
        query: ['mm3/w', 'mm^3/w', 'cubic millimetre/w', /^cub(ic)?\s?mil(li(met(r(e(s)?)?)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'миллиметр/куб в н', 'мм3/н', 'мм^3/н', /^милликубометр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?мил(ли(метр(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_mile_week: {
        r: '0.0000000002399/604800',
        query: ['mi3/w', 'mi^3/w', 'cubic mile/w', /^cub(ic)?\s?mi(l(e(s)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'миля/куб в н', 'миля3/н', 'миля^3/н', 'мили/куб в н', 'мили3/н', 'мили^3/н', 'миль/куб в н', 'миль3/н', 'миль^3/н', /^ми(л(ь|я|и|ю)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ми(л(ь|я|и|ю)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_yard_week: {
        r: '1.308/604800',
        query: ['yd3/w', 'yd^3/w', 'cubic yard/w', /^cub(ic)?\s?ya(r(d(s)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'ярд/куб в н', 'ярд3/н', 'ярд^3/н', 'ярда/куб в н', 'ярда3/н', 'ярда^3/н', 'ярдов/куб в н', 'ярдов3/н', 'ярдов^3/н', /^яр(д(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?яр(д(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_feet_week: {
        r: '35.31/604800',
        query: ['ft3/w', 'ft^3/w', 'cubic feet/w', /^cub(ic)?\s?fe(e(t(s)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'фут/куб в н', 'фут3/н', 'фут^3/н', 'фута/куб в н', 'фута3/н', 'фута^3/н', 'футов/куб в н', 'футов3/н', 'футов^3/н', /^фу(т(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?фу(т(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    cubic_inch_week: {
        r: '61024/604800',
        query: ['in3/w', 'in^3/w', 'cubic inch/w', /^cub(ic)?\s?in(c(h(es)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'дюйм/куб в н', 'дюйм3/н', 'дюйм^3/н', 'дюйма/куб в н', 'дюйма3/н', 'дюйма^3/н', 'дюймов/куб в н', 'дюймов3/н', 'дюймов^3/н', /^дю(йм(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?дю(йм(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    hectolitre_week: {
        r: '10/604800',
        query: [/^hect(o(litre(s)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'hclt/w', 'hl/w', /^гект(о(литр(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'гл/н']
    },
    decalitre_week: {
        r: '100/604800',
        query: [/^deca(litre(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'decalt/w', 'decal/w', /^дек(а(литр(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'декал/н']
    },
    litre_week: {
        r: '1000/604800',
        query: [/^(litre(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'lt/w', 'l/w', /^(литр(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'л/н']
    },
    decilitre_week: {
        r: '10000/604800',
        query: [/^deci(litre(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'dclt/w', 'dl/w', /^деци(литр(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'дл/н']
    },
    centilitre_week: {
        r: '100000/604800',
        query: [/^centi(litre(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'clt/w', 'cl/w', /^санти(литр(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'сл/н']
    },
    millilitre_week: {
        r: '1000000/604800',
        query: [/^milli(litre(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'mlt/w', 'ml/w', /^милли(литр(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'мл/н']
    },
    microlitre_week: {
        r: '1000000000/604800',
        query: [/^micro(litre(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'mclt/w', 'mcl/w', /^микро(литр(ов|а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'мкл/н']
    },
    gallon_usa_week: {
        r: '264.2/604800',
        query: [/^gal(lon(s)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'gals/w', 'gln/w', 'гал/н', /^гал(л(он(ов|а|ы|е)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'гл/н']
    },
    pint_usa_week: {
        r: '2113/604800',
        query: [/^pint(s)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'pts/w', 'pt/w', /^пин(т(а|ы|е)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'пт/н']
    },
    fluid_ounce_usa_week: {
        r: '33814/604800',
        query: [/^fl(u(id)?)?\s?o(un(ce)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'floz/w', 'fl oz/w', 'жиун/н', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s?ун(ц(ии|ия|ий|ию)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i]
    },
    barrel_oil_week: {
        r: '6.29/604800',
        query: [/^bar(r(el(s)?)?)?\s?(w(e(e(k(s)?)?)?)?)?$/i, 'bars/w', 'brl/w', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s?н(е(д(е(л(ь|я)?)?)?)?)?$/i, 'бр/н', 'брл/н']
    },
    cubic_metre_year: {
        r: '1/31556926',
        query: ['m3/y', 'm^3/y', 'cubic metre/y', /^cub(ic)?\s?m(et(r(e(s)?)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'метр/куб в г', 'м3/г', 'м^3/г', /^кубометр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^м(етр(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?м(етр(ов|а|ы|е)?)?\s?г(о(д)?)?$/i,/^куб(ов|а|ы|е)\s?г(о(д)?)?$/i]
    },
    cubic_kilometre_year: {
        r: '0.000000001/31556926',
        query: ['km3/y', 'km^3/y', 'cubic kilometre/y', /^cub(ic)?\s?k(ilo(met(r(e(s)?)?)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'километр/куб в г', 'км3/г', 'км^3/г', /^килокубометр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^кубокилометр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^к(ило(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?к(ило(метр(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i]
    },
    cubic_decimetre_year: {
        r: '1000/31556926',
        query: ['dm3/y', 'dm^3/y', 'cubic decimetre/y', /^cub(ic)?\s?d(eci(met(r(e(s)?)?)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'дециметр/куб в г', 'дм3/г', 'дм^3/г', /^децикубометр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^кубодециметр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^д(еци(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?д(еци(метр(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i]
    },
    cubic_centimetre_year: {
        r: '1000000/31556926',
        query: ['cm3/y', 'cm^3/y', 'cubic centimetre/y', /^cub(ic)?\s?c(enti(met(r(e(s)?)?)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'сантиметр/куб в г', 'см3/г', 'см^3/г', /^сантикубометр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^кубосантиметр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^с(анти(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?с(анти(метр(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i]
    },
    cubic_millimetre_year: {
        r: '1000000000/31556926',
        query: ['mm3/y', 'mm^3/y', 'cubic millimetre/y', /^cub(ic)?\s?mil(li(met(r(e(s)?)?)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'миллиметр/куб в г', 'мм3/г', 'мм^3/г', /^милликубометр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^кубомиллиметр(ов|а|ы|е)?\s?г(о(д)?)?$/i, /^мил(ли(метр(ов|а|ы|е)?)?)?\s?куб(ич(еск(их|ого|ий|ом)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом)?)?)?\s?мил(ли(метр(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i]
    },
    cubic_mile_year: {
        r: '0.0000000002399/31556926',
        query: ['mi3/y', 'mi^3/y', 'cubic mile/y', /^cub(ic)?\s?mi(l(e(s)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'миля/куб в г', 'миля3/г', 'миля^3/г', 'мили/куб в г', 'мили3/г', 'мили^3/г', 'миль/куб в г', 'миль3/г', 'миль^3/г', /^ми(л(ь|я|и|ю)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?ми(л(ь|я|и|ю)?)?\s?г(о(д)?)?$/i]
    },
    cubic_yard_year: {
        r: '1.308/31556926',
        query: ['yd3/y', 'yd^3/y', 'cubic yard/y', /^cub(ic)?\s?ya(r(d(s)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'ярд/куб в г', 'ярд3/г', 'ярд^3/г', 'ярда/куб в г', 'ярда3/г', 'ярда^3/г', 'ярдов/куб в г', 'ярдов3/г', 'ярдов^3/г', /^яр(д(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?яр(д(ов|а|ы|е)?)?\s?г(о(д)?)?$/i]
    },
    cubic_feet_year: {
        r: '35.31/31556926',
        query: ['ft3/y', 'ft^3/y', 'cubic feet/y', /^cub(ic)?\s?fe(e(t(s)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'фут/куб в г', 'фут3/г', 'фут^3/г', 'фута/куб в г', 'фута3/г', 'фута^3/г', 'футов/куб в г', 'футов3/г', 'футов^3/г', /^фу(т(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?фу(т(ов|а|ы|е)?)?\s?г(о(д)?)?$/i]
    },
    cubic_inch_year: {
        r: '61024/31556926',
        query: ['in3/y', 'in^3/y', 'cubic inch/y', /^cub(ic)?\s?in(c(h(es)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'дюйм/куб в г', 'дюйм3/г', 'дюйм^3/г', 'дюйма/куб в г', 'дюйма3/г', 'дюйма^3/г', 'дюймов/куб в г', 'дюймов3/г', 'дюймов^3/г', /^дю(йм(ов|а|ы|е)?)?\s?куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?г(о(д)?)?$/i, /^куб(ич(еск(их|ого|ий|ом|ая)?)?)?\s?дю(йм(ов|а|ы|е)?)?\s?г(о(д)?)?$/i]
    },
    hectolitre_year: {
        r: '10/31556926',
        query: [/^hect(o(litre(s)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'hclt/y', 'hl/y', /^гект(о(литр(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i, 'гл/г']
    },
    decalitre_year: {
        r: '100/31556926',
        query: [/^deca(litre(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'decalt/y', 'decal/y', /^дек(а(литр(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i, 'декал/г']
    },
    litre_year: {
        r: '1000/31556926',
        query: [/^(litre(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'lt/y', 'l/y', /^(литр(ов|а|ы|е)?)?\s?г(о(д)?)?$/i, 'л/г']
    },
    decilitre_year: {
        r: '10000/31556926',
        query: [/^deci(litre(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'dclt/y', 'dl/y', /^деци(литр(ов|а|ы|е)?)?\s?г(о(д)?)?$/i, 'дл/г']
    },
    centilitre_year: {
        r: '100000/31556926',
        query: [/^centi(litre(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'clt/y', 'cl/y', /^санти(литр(ов|а|ы|е)?)?\s?г(о(д)?)?$/i, 'сл/г']
    },
    millilitre_year: {
        r: '1000000/31556926',
        query: [/^milli(litre(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'mlt/y', 'ml/y', /^милли(литр(ов|а|ы|е)?)?\s?г(о(д)?)?$/i, 'мл/г']
    },
    microlitre_year: {
        r: '1000000000/31556926',
        query: [/^micro(litre(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'mclt/y', 'mcl/y', /^микро(литр(ов|а|ы|е)?)?\s?г(о(д)?)?$/i, 'мкл/г']
    },
    gallon_usa_year: {
        r: '264.2/31556926',
        query: [/^gal(lon(s)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'gals/y', 'gln/y', 'гал/г', /^гал(л(он(ов|а|ы|е)?)?)?\s?г(о(д)?)?$/i, 'гл/г']
    },
    pint_usa_year: {
        r: '2113/31556926',
        query: [/^pint(s)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'pts/y', 'pt/y', /^пин(т(а|ы|е)?)?\s?г(о(д)?)?$/i, 'пт/г']
    },
    fluid_ounce_usa_year: {
        r: '33814/31556926',
        query: [/^fl(u(id)?)?\s?o(un(ce)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'floz/y', 'fl oz/y', 'жиун/г', /^ж(ид(к(ая|их|ую|ой|)?)?)?\s?ун(ц(ии|ия|ий|ию)?)?\s?г(о(д)?)?$/i]
    },
    barrel_oil_year: {
        r: '6.29/31556926',
        query: [/^bar(r(el(s)?)?)?\s?(y(e(a(r(s)?)?)?)?)?$/i, 'bars/y', 'brl/y', /^бар(р(ел(ей|и|ь|е|ю|еи)?)?)?\s?г(о(д)?)?$/i, 'бр/г', 'брл/г']
    }
}

module.exports = data;
